Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/tabulardataingest/csv-tsv.po
Languages: pl

source: |toctitle|
pl: **Zawartość:**

source: Ingest of Comma-Separated Values and Tab-Separated Values files as tabular data.
pl: Analiza plików tabelarycznych zawierających wartości oddzielone przecinkami i wartości oddzielone tabulatorami

source: Dataverse will make an attempt to turn CSV and TSV files uploaded by the user into tabular data, using the `Apache CSV parser <https://commons.apache.org/proper/commons-csv/>`_, with one added modification:
pl: Repozytorium podejmie próbę analizy plików CSV i TSV przesłanych przez użytkownika i przekształcenia ich w dane tabelaryczne przy użyciu parsera Apache CSV, z jedną modyfikacją.

source: In case of a CSV file, two different scenarios will be tried. First, parser will attempt to treat the semicolon ``;`` sign as a separator. If this attempt fails, comma ``,`` sign will be tried. We added this feature as an attempt to meet the needs of users exporting their CSV files from Microsoft Excel software, where semicolon is infamously the default separator.
pl: W przypadku plików CSV zostaną wypróbowane dwa scenariusze. Najpierw parser postara się traktować średnik ``;`` jako znak separatora. Jeśli ta próba zakończy się niepowodzeniem, wypróbowany zostanie przecinek ``,``. Dodaliśmy tę funkcjonalność, by wyjść naprzeciw potrzebom tych użytkowników, którzy eksportują swoje pliki CSV z oprogramowania Microsoft Windows. Tam domyślnym separatorem jest, niestety, średnik.

source: Main formatting requirements
pl: Wymagania dotyczące formatowania

source: The first row in the document will be treated as the CSV's header, containing variable names for each column.
pl: Pierwszy wiersz w dokumencie będzie traktowany jak nagłówek CSV zawierający nazwy zmiennych w każdej kolumnie.

source: Each following row must contain the same number of comma-separated values ("cells") as that header.
pl: Każdy następny wiersz musi zawierać tę samą liczbę wartości oddzielonych przecinkami ("komórek"), co ten nagłówek.

source: As of the Dataverse 4.8 release, we allow ingest of CSV files with commas and line breaks within cells. A string with any number of commas and line breaks enclosed within double quotes is recognized as a single cell. Double quotes can be encoded as two double quotes in a row (``""``).
pl: Od wersji Dataverse 4.8 dopuszczono przetwarzanie plików CSV z przecinkami i podziałami linii w komórkach. Ciąg z dowolną liczbą przecinków i podziałów wierszy zawartych w podwójnych cudzysłowach jest rozpoznawany jako pojedyncza komórka. Podwójne cudzysłowy można zakodować jako dwa podwójne cudzysłowy w wierszu (``""``).

source: For example, the following lines:
pl: Na przykład następujące linie:

source: are recognized as a **single** row with **5** comma-separated values (cells):
pl: są rozpoznawane jako **pojedynczy** wiersz z **5** wartościami oddzielonymi przecinkami (komórkami):

source: (where ``\n`` is a new line character)
pl: (gdzie ``\n`` jest znakiem nowej linii).

source: Limitations
pl: Ograniczenia

source: Compared to other formats, relatively little information about the data ("variable-level metadata") can be extracted from a CSV file. Aside from the variable names supplied in the top line, the ingest will make an educated guess about the data type of each comma-separated column. One of the supported rich file formats (Stata, SPSS and R) should be used if you need to provide more descriptive variable-level metadata (variable labels, categorical values and labels, explicitly defined data types, etc.).
pl: W porównaniu do innych formatów, z pliku CSV można wyodrębnić stosunkowo niewiele informacji o danych ("metadanych na poziomie zmiennej"). Oprócz nazw zmiennych podanych w górnym wierszu przetwarzanie będzie domniemywać, jakiego typu dane zawierają kolumny oddzielone przecinkami. Należy użyć jednego z obsługiwanych formatów plików sformatowanych (Stata, SPSS i R), jeśli trzeba podać bardziej opisowe metadane na poziomie zmiennej (etykiety zmiennych, wartości kategorialne i etykiety, wyraźnie zdefiniowane typy danych itp.).

source: Recognized data types and formatting
pl: Rozpoznanawanie typów danych i formatowanie

source: The application will attempt to recognize numeric, string, and date/time values in the individual columns.
pl: Aplikacja będzie próbowała rozpoznać w poszczególnych kolumnach wartości: liczbowe, ciągi znaków oraz daty/godziny.

source: For dates, the ``yyyy-MM-dd`` format is recognized.
pl: W przypadku dat rozpoznawany jest format ``rrrr-MM-dd``.

source: For date-time values, the following 2 formats are recognized:
pl: W przypadku wartości daty i godziny rozpoznawane są następujące 2 formaty:

source: ``yyyy-MM-dd HH:mm:ss``
pl: ``rrrr-MM-dd HH:mm:ss``

source: ``yyyy-MM-dd HH:mm:ss z`` (same format as the above, with the time zone specified)
pl: ``rrrr-MM-dd HH:mm:ss z`` (taki sam format jak powyżej, z podaną strefą czasową)

source: For numeric variables, the following special values are recognized:
pl: W przypadku zmiennych numerycznych rozpoznawane są następujące wartości specjalne:

source: ``inf``, ``+inf`` - as a special IEEE 754 "positive infinity" value;
pl: ``inf``, ``+inf`` - jako specjalna wartość "dodatniej nieskończoności" według IEEE 754;

source: ``NaN`` - as a special IEEE 754 "not a number" value;
pl: ``NaN`` - jako specjalna wartość "brak liczby" według IEEE 754;

source: An empty value (i.e., a comma followed immediately by another comma, or the line end), or ``NA`` - as a *missing value*.
pl: Pusta wartość (tj. przecinek, po którym bezpośrednio następuje kolejny przecinek lub koniec linii), lub NA - jako brakująca wartość.

source: ``null`` - as a numeric *zero*.
pl: ``null`` - jako *zero* numeryczne.

source: (any combinations of lower and upper cases are allowed in the notations above).
pl: (w powyższych notacjach dozwolone są dowolne kombinacje małych i wielkich liter).

source: In character strings, an empty value (a comma followed by another comma, or the line end) is treated as an empty string (NOT as a *missing value*).
pl: W ciągach znaków pusta wartość (przecinek, po którym następuje kolejny przecinek lub koniec linii) jest traktowana jako pusty ciąg (NIE jako *brakująca wartość*).

source: Any non-Latin characters are allowed in character string values, **as long as the encoding is UTF8**.
pl: W wartościach ciągów znaków dozwolone są wszelkie znaki spoza alfabetu łacińskiego, **o ile są kodowane w UTF8**.

source: When the ingest recognizes a CSV or TSV column as a numeric vector, or as a date/time value, this information is reflected and saved in the database as the *data variable metadata*. To inspect that metadata, click on the *Download* button next to a tabular data file, and select *Variable Metadata*. This will export the variable records in the DDI XML format. (Alternatively, this metadata fragment can be downloaded via the Data Access API; for example: ``http://localhost:8080/api/access/datafile/<FILEID>/metadata/ddi``).
pl: Gdy przetwarzanie rozpozna kolumnę CSV lub TSV jako wektor numeryczny lub wartość daty/godziny, informacje te zostaną odzwierciedlone i zapisane w bazie danych jako metadane zmiennych. Aby sprawdzić te metadane, kliknij przycisk Pobierz obok pliku danych tabelarycznych i wybierz Metadane zmiennych. Spowoduje to wyeksportowanie rekordów zmiennych w formacie DDI XML. (Alternatywnie ten fragment metadanych można pobrać za pośrednictwem interfejsu API Dostęp do Danych; na przykład: ``http://localhost:8080/api/access/datafile/<FILEID>/metadata /ddi``).

source: The most immediate implication is in the calculation of the UNF signatures for the data vectors, as different normalization rules are applied to numeric, character, and date/time values. (see the :doc:`/developers/unf/index` section for more information). If it is important to you that the UNF checksums of your data are accurately calculated, check that the numeric and date/time columns in your file were recognized as such (as ``type=numeric`` and ``type=character, category=date(time)``, respectively). If, for example, a column that was supposed to be numeric is recognized as a vector of character values (strings), double-check that the formatting of the values is consistent. Remember, a single improperly-formatted value in the column will turn it into a vector of character strings, and result in a different UNF. Fix any formatting errors you find, delete the file from the dataset, and try to ingest it again.
pl: Najbardziej bezpośrednią implikacją tego jest sposób obliczania sygnatur UNF dla wektorów danych, ponieważ różne zasady normalizacji są stosowane do wartości liczbowych, znakowych oraz daty/godziny. (więcej informacji znajduje się w części :doc:`/developers/unf/index`). Jeśli jest ważne, aby sumy kontrolne UNF danych zostały dokładnie obliczone, należy sprawdzić, czy kolumny liczbowe i te zawierające daty/godziny w danym pliku zostały rozpoznane jako takie (odpowiednio jako ``type=numeric`` i ``type=character``, oraz ``category=date(time)``). Jeśli np. kolumna, która miała być numeryczna, zostanie rozpoznana jako wektor wartości znakowych (ciągów znaków), należy dokładnie sprawdzić, czy formatowanie wartości jest spójne. Trzeba pamiętać, że jedna niepoprawnie sformatowana wartość w kolumnie zamieni ją w wektor ciągów znaków i spowoduje wygenerowanie innego UNF. Należy poprawić wszystkie znalezione błędy formatowania, usunąć plik z zestawu danych i ponownie podjąć próbę analizy.
