Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/tabulardataingest/excel.po
Languages: pl

source: Microsoft Excel files (XLSX format).
pl: Pliki Microsoft Excel (format XLSX).

source: |toctitle|
pl: **Zawartość:**

source: Supported Formats
pl: Wspierane formaty

source: Only the "new", XLSX Excel files are supported. We are not planning to add support for the old-style, binary XLS files. XLS files will *not* be ingested.
pl: Wspierane są jedynie "nowe" pliki programu Excel w formacie XLSX. Nie ma w planach wsparcia dla starych, binarnych plików XLS. Pliki w formacie XLS *nie* zostaną poddane analizie.

source: We strongly encourage NOT using the old, binary XLS files. Apart from concerns with its strictly proprietary nature, the format simply wasn't designed for storing large scientific data, and that is often misunderstood. One such file can only store up to 65535 rows of data and **doesn't prompt user in any way** upon saving a file if this limit is exceeded. When the file is saved and the editor closed, the data is silently truncated and lost.
pl: Zdecydowanie ODRADZAMY korzystanie ze starych, binarnych plików XLS. Format ten wzbudza wątpliwości związane z jego własnościowym charakterem, ale też – co często bywa opacznie rozumiane – po prostu nie został zaprojektowany z myślą o przechowywaniu dużych ilości danych naukowych. Pojedynczy plik w tym formacie może przechowywać maksymalnie 65535 wierszy z danymi, a w momencie jego zapisu użytkownik **w żaden sposób nie jest informowany, że limit został przekroczony**. Gdy plik zostanie zapisany, a użytkownik zamknie jego edytor, dane zostaną po cichu przycięte i zginą bezpowrotnie.

source: Limitations
pl: Ograniczenia

source: If an Excel file has multiple sheets, only the first sheet of the file will be ingested. The other sheets will be available when a user downloads the original Excel file. To have all sheets of an Excel file ingested and searchable at the variable level, upload each sheet as an individual file in your dataset.
pl: Jeśli w pliku znajduje się wiele arkuszy, przeanalizowany zostanie tylko pierwszy z nich. Pozostałe arkusze są dostępne w oryginalnym pliku Excela, który użytkownik może pobrać. Aby przeanalizowane zostały wszystkie arkusze z danego pliku i możliwe stało się ich przeszukiwanie na poziomie zmiennych, do zbioru danych każdy arkusz należy przesłać w osobnym pliku.

source: Ingest Errors
pl: Błędy analizy

source: You may encounter ingest errors after uploading an Excel file if the file is formatted in a way that can’t be ingested by the Dataverse software. Ingest errors can be caused by a variety of formatting inconsistencies, including:
pl: Jeśli plik XLSX został sformatowany w sposób, który uniemożliwia jego poprawną analizę przez oprogramowanie Dataverse, po jego przesłaniu pojawią się błędy. Ich powodem mogą być różnego rodzaju niespójności formatowania, włączając w to:

source: line breaks in a cell
pl: podział wiersza w obrębie komórki,

source: blank cells
pl: puste komórki,

source: single cells that span multiple rows or columns (i.e. merged cells)
pl: pojedyncze komórki obejmujące wiele wierszy lub kolumn (tzw. scalone komórki),

source: missing headers
pl: brakujące nagłówki.

source: Example Data
pl: Przykładowe dane

source: `An example of an Excel file that successfully ingests <https://github.com/IQSS/dataverse-sample-data/blob/master/data/dataverses/dataverseno/datasets/tabular-sample-data/files/Tabular_Sample_Data.xlsx>`_ is available in the Dataverse Sample Data GitHub repository.
pl: `Przykładowy plik XLSX, który pomyślnie przeszedł analizę <https://github.com/IQSS/dataverse-sample-data/blob/master/data/dataverses/dataverseno/datasets/tabular-sample-data/files/Tabular_Sample_Data.xlsx>`_, można pobrać z repozytorium GitHub.
