Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/tabulardataingest/rdata.po
Languages: pl

source: R Data Format
pl: Dane w formacie R

source: Support for R (.RData) files has been introduced in DVN 3.5.
pl: Wsparcie plików R (R.Data) zostało dodane w DVN 3.5.

source: |toctitle|
pl: Zawartość:

source: Overview
pl: Uwagi ogólne

source: R has been increasingly popular in the research/academic community, owing to the fact that it is free and open-source (unlike SPSS and STATA). Consequently, there is an increasing amount of data available exclusively in R format.
pl: R cieszy się coraz większą popularnością w środowisku badaczy i świecie akademickim. Jest to bezpłatne oprogramowanie o otwartym kodzie źródłowym (w przeciwieństwie do pakietów SPSS i STATA). W związku z tym rośnie ilość danych dostępnych wyłącznie w formacie R.

source: Data Formatting Requirements
pl: Wymagania dotyczące formatowania danych

source: The data must be formatted as an R dataframe (data.frame()). If an .RData file contains multiple dataframes, only the 1st one will be ingested.
pl: Dane muszą być sformatowane jako ramka danych programu R (data.frame()). Aktualnie jeśli plik .RData zawiera wiele ramek danych, przeanalizowana zostanie tylko pierwsza z nich.

source: Data Types, compared to other supported formats (Stat, SPSS)
pl: Typy danych a inne obsługiwane formaty (Stata, SPSS)

source: Integers, Doubles, Character strings
pl: Typy Integer, Double oraz Character

source: The handling of these types is intuitive and straightforward. The resulting tab file columns, summary statistics and UNF signatures should be identical to those produced by ingesting the same vectors from SPSS and Stata.
pl: Obsługa tych typów jest intuicyjna i prosta. Powstałe kolumny pliku TAB, miary rozkładu i sygnatury UNF powinny być identyczne z tymi, które powstały w wyniku przetworzenia tych samych wektorów z plików w formatach SPSS i Stata.

source: **Things that are unique to R:**
pl: **Rzeczy unikalne dla R:**

source: R explicitly supports Missing Values for all of the types above; Missing Values encoded in R vectors will be recognized and preserved in TAB files, counted in the generated summary statistics and data analysis. Please note however that the Dataverse notation for a missing value, as stored in a TAB file, is an empty string, an not "NA" as in R.
pl: R umożliwia bezpośrednią obsługuję brakujących wartości (Missing Values) dla wszystkich powyższych typów. Brakujące wartości zakodowane w wektorach R zostaną rozpoznane i zapisane w plikach TAB, uwzględnione w wygenerowanych miarach rozkładu i analizie danych. Należy jednak pamiętać, że Dataverse dla oznaczenia brakującej wartości, przechowuje w pliku TAB pusty ciąg znaków, podczas gdy w R w tym samym celu używane jest "NA".

source: In addition to Missing Values, R recognizes "Not a Value" (NaN) and positive and negative infinity for floating point variables. These are now properly supported by the Dataverse.
pl: Oprócz brakujących wartości, R dla wartości zmiennoprzecinkowych rozpoznaje również oznaczenie NaN oraz dodatnią i ujemną nieskończoność. Obecnie są one poprawnie obsługiwane przez Dataverse.

source: Also note, that unlike Stata, that does recognize "float" and "double" as distinct data types, all floating point values in R are in fact doubles.
pl: Trzeba też zauważyć, że w przeciwieństwie do formatu Stata, który traktuje liczby zmiennoprzecinkowe typu "float" oraz typu "double" jako odrębne typy danych, wszystkie wartości zmiennoprzecinkowe w R są typu "double".

source: R Factors
pl: Typ Factor w R

source: These are ingested as "Categorical Values" in the Dataverse.
pl: W Dataverse typ Factor języka R jest traktowany jak zmienna kategorialna.

source: One thing to keep in mind: in both Stata and SPSS, the actual value of a categorical variable can be both character and numeric. In R, all factor values are strings, even if they are string representations of numbers. So the values of the resulting categoricals in the Dataverse will always be of string type too.
pl: Należy pamiętać o tym, że zarówno w programie Stata, jak i w SPSS, wartość zmiennej kategorialnej może być zarówno ciągiem znaków, jak i mieć charakter numeryczny. W R natomiast wszystkie wartości typu Factor są łańcuchami znaków, nawet jeśli reprezentują one liczby. Zatem również wartości wynikowe typu Factor w Dataverse zawsze będą ciągami znaków.

source: Another thing to note is that R factors have no builtin support for SPSS or STATA-like descriptive labels. This is in fact potentially confusing, as they also use the word "label", in R parlance. However, in the context of a factor in R, it still refers to the "payload", or the data content of its value. For example, if you create a factor with the "labels" of *democrat*, *republican* and *undecided*, these strings become the actual values of the resulting vector. Once ingested in the Dataverse, these values will be stored in the tab-delimited file. The Dataverse DataVariable object representing the vector will be of type "Character" and have 3 VariableCategory objects with the *democrat*, etc. for **both** the CategoryValue and CategoryLabel.
pl: Należy również zauważyć, że typ Factor w R nie ma wbudowanej obsługi etykiet opisowych typu SPSS lub STATA. Jest to potencjalnie mylące, ponieważ w języku R również używane jest słowo "etykieta" ("label"). Jednak w kontekście typu Factor w języku R nadal odnosi się do treści danych. Np. przy tworzeniu zmiennej typu Factor z "etykietami" opisującymi poparcie dla określonych partii politycznych, np. "demokrata", "republikanin", "niezdecydowany", te ciągi stają się rzeczywistymi wartościami wynikowego wektora. W Dataverse wartości te zostaną zapisane w pliku rozdzielanym tabulatorami. Obiekt Dataverse DataVariable reprezentujący wektor będzie typu "Character" i będzie zawierał 3 obiekty VariableCategory ("demokrata", "republikanin" etc.) **zarówno** w przypadku CategoryValue, jak i CategoryLabel.

source: Boolean values
pl: Wartości logiczne

source: R Boolean (logical) values are supported.
pl: Wartości boolowskie (logiczne) są obsługiwane.

source: Limitations of R, as compared to SPSS and STATA
pl: Ograniczenia R w porównaniu do SPSS i STATA

source: Most noticeably, R lacks a standard mechanism for defining descriptive labels for the data frame variables. In the Dataverse, similarly to both Stata and SPSS, variables have distinct names and labels; with the latter reserved for longer, descriptive text. With variables ingested from R data frames the variable name will be used for both the "name" and the "label".
pl: Najbardziej zauważalną cechą R jest to, że nie ma on standardowego mechanizmu do definiowania opisowych etykiet dla zmiennych w postaci ramki danych. W Dataverse, podobnie jak w Stata i SPSS, zmienne mają różne nazwy i etykiety; etykiety zastrzeżone są dla dłuższego, opisowego tekstu. W przypadku zmiennych pobieranych z ramek danych R nazwa zmiennej będzie używana zarówno dla "nazwy", jak i "etykiety".

source: *Optional R packages exist for providing descriptive variable labels; in one of the future versions support may be added for such a mechanism. It would of course work only for R files that were created with such optional packages*.
pl: *Istnieją opcjonalne pakiety R umożliwiające stosowanie opisowych etykiet zmiennych; w jednej z przyszłych wersji można dodać obsługę takiego mechanizmu. Oczywiście działałoby to tylko dla plików R, które zostały utworzone za pomocą takich opcjonalnych pakietów*

source: Similarly, R categorical values (factors) lack descriptive labels too. **Note:** This is potentially confusing, since R factors do actually have "labels". This is a matter of terminology - an R factor's label is in fact the same thing as the "value" of a categorical variable in SPSS or Stata and Dataverse; it contains the actual meaningful data for the given observation. It is NOT a field reserved for explanatory, human-readable text, such as the case with the SPSS/Stata "label".
pl: Podobnie wartościom kategorialnym R (zmiennym typu "factor") również brakuje opisowych etykiet. **Uwaga:** Jest to potencjalnie mylące, ponieważ zmienne typu factor w R w rzeczywistości mają "etykiety". Jest to kwestia terminologii - etykieta w ich przypadku jest w rzeczywistości tym samym, co "wartość" zmiennej kategorialnej w SPSS, Stata czy Dataverse; zawiera rzeczywiste, znaczące dane dla danej obserwacji. NIE jest to pole zarezerwowane dla tekstu objaśniającego, czytelnego dla człowieka, tak jak w przypadku "etykiety" SPSS/Stata.

source: Ingesting an R factor with the level labels "MALE" and "FEMALE" will produce a categorical variable with "MALE" and "FEMALE" in the values and labels both.
pl: Analiza zmiennej typu "factor" w R z etykietami poziomu "MALE" (mężczyzna) i "FEMALE" (kobieta) spowoduje utworzenie zmiennej kategorialnej z "MALE" i "FEMALE" zarówno w wartościach, jak i etykietach.

source: Time values in R
pl: Wartości czasu w R

source: This warrants a dedicated section of its own, because of some unique ways in which time values are handled in R.
pl: Sekcja została wydzielona ze względu na unikatowy sposób obsługi czasu w języku R.

source: R makes an effort to treat a time value as a real time instance. This is in contrast with either SPSS or Stata, where time value representations such as "Sep-23-2013 14:57:21" are allowed; note that in the absence of an explicitly defined time zone, this value cannot be mapped to an exact point in real time. R handles times in the "Unix-style" way: the value is converted to the "seconds-since-the-Epoch" Greenwich time (GMT or UTC) and the resulting numeric value is stored in the data file; time zone adjustments are made in real time as needed.
pl: R stara się traktować wartość czasu jako instancję czasu rzeczywistego. Odmienne podejście spotkać można w programach SPSS i Stata, gdzie dopuszcza się reprezentacje wartości czasu takie jak np. „Sep-23-2013 14:57:21”. Należy zauważyć, że przy braku wyraźnie określonej strefy czasowej tej wartości nie można dokładnie odwzorować na punkt w czasie rzeczywistym. R obsługuje czasy w sposób "Unix’owy": wartość jest konwertowana na czas Greenwich (GMT lub UTC) wyrażony w sekundach od początku epoki Unix’a, a wynikowa wartość liczbowa jest przechowywana w pliku danych; w razie potrzeby dostosowuje się strefę czasową w czasie rzeczywistym.

source: Things still get ambiguous and confusing when R **displays** this time value: unless the time zone was explicitly defined, R will adjust the value to the current time zone. The resulting behavior is often counter-intuitive: if you create a time value, for example:
pl: Sprawa staje się niejednoznaczna i myląca, gdy R **wyświetla** tę wartość czasu: jeżeli strefa czasowa nie została jawnie zdefiniowana, R dostosuje wartość do bieżącej strefy czasowej. Wynik jest często sprzeczny z intuicją: jeśli utworzysz wartość czasu, np.:

source: on a computer configured for the San Francisco time zone, the value will be differently displayed on computers in different time zones; for example, as "12:57 PST" while still on the West Coast, but as "15:57 EST" in Boston.
pl: na komputerze ze skonfigurowaną strefą czasową dla San Francisco, wartość będzie różnie wyświetlana na komputerach w innych strefach czasowych; na przykład na Zachodnim Wybrzeżu jako "12:57 PST", ale jako "15:57 EST" w Bostonie.

source: If it is important that the values are always displayed the same way, regardless of the current time zones, it is recommended that the time zone is explicitly defined. For example:
pl: Jeśli ważne jest, aby wartości były zawsze wyświetlane w ten sam sposób, niezależnie od bieżących stref czasowych, zaleca się jawne zdefiniowanie strefy czasowej. Można to zrobić w następujący sposób:

source: or
pl: lub

source: Now the value will always be displayed as "15:57 PST", regardless of the time zone that is current for the OS ... **BUT ONLY** if the OS where R is installed actually understands the time zone "PST", which is not by any means guaranteed! Otherwise, it will **quietly adjust** the stored GMT value to **the current time zone**, yet it will still display it with the "PST" tag attached!** One way to rephrase this is that R does a fairly decent job **storing** time values in a non-ambiguous, platform-independent manner - but gives you no guarantee that the values will be displayed in any way that is predictable or intuitive.
pl: Teraz wartość będzie zawsze wyświetlana jako "15:57 PST", niezależnie od strefy czasowej systemu operacyjnego, na którym jest wyświetlana... **ALE TYLKO** jeśli system operacyjny, na którym zainstalowany jest R, faktycznie poprawnie interpretuje strefę czasową "PST", czego nie można zagwarantować! W przeciwnym razie system **po cichu dostosuje** zapamiętaną wartość GMT do **bieżącej strefy czasowej**, ale nadal wyświetli ją z dołączonym znacznikiem "PST"! Innymi słowy, R dobrze się sprawdza przechowując wartości czasu w jednoznaczny i niezależny od platformy sposób, ale nie daje żadnej gwarancji, że wartości te będą wyświetlane w sposób przewidywalny lub intuicyjny.

source: In practical terms, it is recommended to use the long/descriptive forms of time zones, as they are more likely to be properly recognized on most computers. For example, "Japan" instead of "JST". Another possible solution is to explicitly use GMT or UTC (since it is very likely to be properly recognized on any system), or the "UTC+<OFFSET>" notation. Still, none of the above **guarantees** proper, non-ambiguous handling of time values in R data sets. The fact that R **quietly** modifies time values when it doesn't recognize the supplied timezone attribute, yet still appends it to the **changed** time value does make it quite difficult. (These issues are discussed in depth on R-related forums, and no attempt is made to summarize it all in any depth here; this is just to made you aware of this being a potentially complex issue!)
pl: Zaleca się stosowanie długich/opisowych form stref czasowych, jako że zwiększa to prawdopodobieństwo ich poprawnego odczytania na większości komputerów. Na przykład lepiej jest posłużyć się zwrotem "Japan" zamiast "JST". Innym możliwym rozwiązaniem jest stosowanie GMT lub UTC (jest bardzo prawdopodobne, że zostaną poprawnie rozpoznane przez dowolny system) lub notacji ``UTC+<PRZESUNIĘCIE>``. Nadal jednak żadne z powyższych rozwiązań nie **gwarantuje** poprawnej, jednoznacznej obsługi wartości czasu w danych R. Dość kłopotliwe jest to, że R **po cichu** modyfikuje wartości czasu, gdy nie rozpoznaje podanego atrybutu strefy czasowej, ale nadal dołącza go do zmienionej w ten sposób wartości czasu. (Zagadnienia te są szczegółowo omawiane na forach związanych z językiem R, w tym miejscu nie podejmujemy się próby ich podsumowania. Chodzi jedynie o to, by zdać sobie sprawę, że jest to złożony problem!).

source: An important thing to keep in mind, in connection with the Dataverse ingest of R files, is that it will **reject** an R data file with any time values that have time zones that we can't recognize. This is done in order to avoid (some) of the potential issues outlined above.
pl: Jeśli chodzi o sposób analizy plików R przez Dataverse, należy pamiętać, że **odrzucony** zostanie plik R z wartościami czasowymi, których strefy czasowe nie zostaną rozpoznane. Dzieje się tak, aby uniknąć (niektórych) potencjalnych problemów opisanych powyżej.

source: It is also recommended that any vectors containing time values ingested into the Dataverse are reviewed, and the resulting entries in the TAB files are compared against the original values in the R data frame, to make sure they have been ingested as expected.
pl: Zaleca się również przejrzenie wszystkich wektorów zawierających wartości czasowe przetworzonych przez Dataverse, a także porównanie wyników otrzymanych w plikach TAB z oryginalnymi wartościami w ramce danych R, aby upewnić się, że zostały one przetworzone zgodnie z oczekiwaniami.

source: Another **potential issue** here is the **UNF**. The way the UNF algorithm works, the same date/time values with and without the timezone (e.g. "12:45" vs. "12:45 EST") **produce different UNFs**. Considering that time values in Stata/SPSS do not have time zones, but ALL time values in R do (yes, they all do - if the timezone wasn't defined explicitly, it implicitly becomes a time value in the "UTC" zone!), this means that it is **impossible** to have 2 time value vectors, in Stata/SPSS and R, that produce the same UNF.
pl: Innym **potencjalnym problemem** jest **UNF**. Sposób działania algorytmu UNF sprawia, że te same wartości daty/godziny ze strefą czasową i bez niej (np. "12:45" i "12:45 EST") **prowadzą do różnych wartości UNF**. Biorąc pod uwagę, że wartości czasu w Stata/SPSS nie mają stref czasowych, ale WSZYSTKIE wartości czasu w R je mają (tak, wszystkie – jeśli strefa czasowa nie została jawnie zdefiniowana, domyślnie przyjmuje się wtedy strefę UTC!). Oznacza to, że **niemożliwe** jest posiadanie 2 wektorów wartości czasowych, w Stata/SPSS i R, które dawałyby ten sam UNF.

source: **A pro tip:** if it is important to produce SPSS/Stata and R versions of the same data set that result in the same UNF when ingested, you may define the time variables as **strings** in the R data frame, and use the "YYYY-MM-DD HH:mm:ss" formatting notation. This is the formatting used by the UNF algorithm to normalize time values, so doing the above will result in the same UNF as the vector of the same time values in Stata.
pl: **Sugestia:** jeśli ważne jest utworzenie wersji SPSS/Stata i R tego samego zbioru danych, które po przetworzeniu dadzą to samo UNF, można zdefiniować zmienne czasowe jako ciągi w ramce danych R i zastosować notację formatującą ``YYYY-MM-DD HH: mm: ss``. Jest to formatowanie stosowane przez algorytm UNF do normalizacji wartości czasu, więc wykonanie powyższego działania pozwoli uzyskać ten sam UNF co w przypadku wektora tych samych wartości czasu w programie Stata.

source: Note: date values (dates only, without time) should be handled the exact same way as those in SPSS and Stata, and should produce the same UNFs.
pl: **Uwaga:** wartości daty (tylko daty, bez czasu) powinny być obsługiwane dokładnie tak samo, jak w programach SPSS i Stata, i powinny generować te same UNF.
