Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/tabulardataingest/spss.po
Languages: pl

source: SPSS data files (POR and SAV formats).
pl: Pliki danych SPSS (formaty POR i SAV).

source: |toctitle|
pl: Zawartość:

source: Supported Versions
pl: Obsługiwane wersje

source: Dataverse supports reading of all SPSS versions 7 to 22. But please see the "Limitations" section.
pl: Oprogramowanie Dataverse obsługuje odczyt formatów SPSS od wersji 7 do 22. Zob. jednak sekcję "Ograniczenia".

source: Limitations
pl: Ograniczenia

source: SPSS does not openly publish the specifications of their proprietary file formats. Our ability to read and parse their files is based on some documentation online from unofficial sources, and some reverse engineering. Because of that we cannot, unfortunately, guarantee to be able to process *any* SPSS file uploaded.
pl: SPSS nie publikuje specyfikacji własnościowych formatów swoich plików. Twórcy oprogramowania Dataverse w zakresie odczytu i analizy plików SPSS opierają się na dokumentacji dostępnej on-line ze źródeł nieoficjalnych oraz na inżynierii wstecznej. Z tego powodu nie ma gwarancji, że repozytorium będzie w stanie przetworzyć *każdy* przesłany plik SPSS.

source: However, we've been improving this process for a few years by now, and it should be quite robust in the current version of Dataverse. Thus your chances of success - uploading an SPSS files and having it turned into a fully functional tabular data table in the Dataverse - should be reasonably good.
pl: Jednak przez kilka ostatnich lat prowadzone były prace mające na celu ulepszenie tego procesu i w aktualnej wersji oprogramowania Dataverse powinien on być dość niezawodny. Zatem szanse na sukces – przesłanie plików SPSS i przekształcenie ich w pełni funkcjonalną tabelę danych – powinny być dość duże.

source: Support for Language Encodings in SPSS
pl: Obsługa kodowania języka w SPSS

source: Historically, there was no support for specifying a particular language/code page encoding for the data stored in an SPSS file. Meaning, text values in none-ASCII encodings, or non-Latin characters could be entered and stored, but there was no setting to unambiguously specify what language, or what character set it was. By default, Dataverse will try to interpret binary characters as UTF8. If that's not working - for example, if the descriptive labels and/or categorical values ingest as garbage - and if you happen to know what encoding was used in the original file, you can now specify it in the Ingest Options.
pl: Historycznie rzecz ujmując, nie było prostej możliwości określenia języka czy też strony kodowej danych przechowywanych w pliku SPSS. Oznacza to, że można wprowadzać i przechowywać wartości tekstowe w kodowaniu innym niż ASCII lub spoza alfabetu łacińskiego, ale brakowało ustawień, które jednoznacznie określałyby, który język lub zestaw znaków został użyty. Domyślnie Dataverse próbuje interpretować znaki binarne jako UTF8. Jeśli to rozwiązanie nie zadziała – na przykład jeśli etykiety opisowe i/lub wartości zmiennych kategorialnych po przetworzeniu wyglądają na losowy ciąg znaków – a skądinąd wiadomo jakie kodowanie zastosowano w oryginalnym pliku, można określić je w "Opcjach przetwarzania".

source: For example, if you know that the text in your SAV file is in Mandarin, and is encoded using the GB2312, specify it as follows:
pl: Na przykład, jeśli wiadomo, że tekst w plik SAV jest w języku mandaryńskim i jest zakodowany przy użyciu GB2312, można postąpić w następujący sposób:

source: Upload your file, in the "Edit Files" tab of the Dataset page. Once the file is recognized as SPSS/save, and *before* you click Save, go into the "Advanced Ingest Options", and select "Simplified Chinese, GB2312" in the nested menu under "Language Encoding" -> "East Asian".
pl: Prześlij plik wybierając opcję "Edytuj pliki" w zakładce "Pliki" na stronie zbioru danych. Jeśli zostanie on rozpoznany jako plik SPSS, przed kliknięcie "Zapisz" przejdź do "Zaawansowanych opcji przetwarzania" i wybierz "Chiński uproszczony, GB2312" – opcja ta będzie widoczna po wybraniu "Kodowanie języków" -> "Azja Wschodnia".
