Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/tabulardataingest/supportedformats.po
Languages: pl

source: Supported File Formats
pl: Obsługiwane formaty plików

source: Tabular Data ingest supports the following file formats:
pl: Przetwarzanie danych tabelarycznych obejmuje następujące formaty plików:

source: File format
pl: Formaty plików

source: Versions supported
pl: Obsługiwane wersje

source: SPSS (POR and SAV formats)
pl: SPSS (Por oraz SAV)

source: 7 to 22
pl: 7 do 22

source: 4 to 13
pl: 4 do 13

source: up to 3
pl: do wersji 3

source: XLSX only (XLS is NOT supported)
pl: XLSX (brak wsparcia dla formatu XLS)

source: CSV (comma-separated values)
pl: CSV (wartości rozdzielone przecinkami)

source: (limited support)
pl: (ograniczone wsparcie)

source: See the subsections in the left sidebar for more information on each of these supported formats.
pl: Więcej informacji na temat każdego z obsługiwanych formatów znajduje się w podrozdziałach w pasku bocznym
