Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/account.po
Languages: pl

source: Account Creation + Management
pl: Tworzenie i zarządzanie kontem

source: |toctitle|
pl: Zawartość:

source: Account Information
pl: Informacje o koncie

source: As a registered user, you can:
pl: W zależności od posiadanych uprawnień, jako zarejestrowany użytkownik możesz:

source: Create your own dataverse, if permitted, and customize it (if the configuration of the parent collection allows it).
pl: Stworzyć swoją własną kolekcję i dostosować ją do swoich potrzeb.

source: Add datasets to dataverses, if permitted.
pl: Dodawać zbiory danych do repozytorium.

source: Contribute to existing datasets, if permitted.
pl: Rozwijać już istniejące zbiory danych.

source: Request access to restricted files.
pl: Poprosić o dostęp do plików w ograniczonym dostępie.

source: Account Log In Options
pl: Opcje logowania

source: Dataverse has been configured for one or more of the following log in options:
pl: W zależności od konfiguracji, do repozytorium można zalogować się przy użyciu co najmniej jednej z poniższych opcji logowania:

source: Username/Email and Password
pl: Nazwa użytkownika/Email i hasło

source: Institutional Log In
pl: Logowanie instytucjonalne

source: Please note that once you create your Dataverse account, it will be associated with only one of the log in options above.
pl: Należy pamiętać, że po utworzeniu konta w repozytorium, będzie ono skojarzone tylko z jedną z powyższych opcji logowania.

source: The Institutional Log In, ORCID, GitHub, and Google options are described in more detail below under :ref:`remote-authentication`.
pl: Opcje logowania instytucjonalnego, ORCID, GitHub i Google są szczegółowo opisane w sekcji :ref:`remote-authentication` znajdującej się poniżej.

source: Create Account
pl: Tworzenie konta

source: To create a Dataverse account with the Username/Email log in option, go to the "Sign In/Sign Up" page and click "Sign Up" button. Fill out the fields, and then click the "Create Account" button. Please note that the Username field does not support email addresses but will allow the following characters: a-Z, 0-9, _ (underscores), - (hyphens), and . (periods).
pl: Aby utworzyć konto z opcją logowania za pomocą nazwy użytkownika/adresu e-mail, wejdź na stronę "Zaloguj/Załóż konto" i kliknij przycik "Załóż konto". Wypełnij pola, a następnie kliknij przycisk "Utwórz konto". Pamiętaj, że pole "Nazwa użytkownika" nie obsługuje adresów e-mail, ale dopuszcza użycie następujących znaków: ``a-Z``, ``0-9``, ``_`` (podkreślnik), ``-`` (myślnik) i ``.`` (kropka).

source: To create a Dataverse account associated with the log in option for your institution, ORCID, GitHub, or Google, go to the "Sign In/Sign Up" page, select one of the authentication providers, and click "Log In" button. See :ref:`remote-authentication` section for details.
pl: Aby utworzyć konto w repozytorium skojarzone z opcją logowania instytucjonalnego, ORCID, GitHub lub Google, wejdź na stronę "Zaloguj/Załóż konto", wybierz jednego z dostawców uwierzytelnienia. Więcej szczegółów można znaleźć w sekcji :ref:`remote-authentication` poniżej.

source: Edit Account
pl: Edycja konta

source: To edit your account after you have logged in, click on your account name in the header on the right hand side and click on Account Information.
pl: Aby edytować swoje konto, po zalogowaniu kliknij na nazwę konta po prawej stronie nagłówka, a następnie kliknij "Informacje o koncie".

source: On the top right of your account page, click on the "Edit Account" button and from there you can select to edit either your Account Information or your Account Password.
pl: W prawym górnym rogu strony konta kliknij na przycisk "Edytuj konto", skąd możesz przejść do edycji informacji o koncie lub do zmiany hasła.

source: Select "Save Changes" when you are done.
pl: Po zakończeniu edycji kliknij przycisk "Zapisz zmiany".

source: Please note that you cannot edit some of your account information within Dataverse if you use the Institutional Log In option. Instead, you should contact your institution to make the necessary changes. Once the change is made by your institution, it will be reflected in Dataverse the next time you log in.
pl: Zwróć uwagę, że nie możesz edytować niektórych danych konta, jeśli korzystasz z opcji logowania instytucjonalnego. W tym wypadku skontaktuj się ze swoją instytucją w celu dokonania zmian. Zmiana wykonana przez Twoją instytucję zostanie uwzględniona w repozytorium przy następnym logowaniu.

source: Convert Account
pl: Przekształcanie konta

source: If more than one log in option is available, you can convert from one to another and use the new option from now on.
pl: Jeśli repozytorium oferuje kilka sposobów logowania, możesz dokonać przekształcenia z jednego sposobu na drugi i używać odtąd tego drugiego

source: If you are converting from the Email/Username log in option you will need to have your password ready to complete the conversion process. Click "Sign In/Sign Up", select the new log in option, and go through the log in process. When you return to Dataverse, look for an option allowing you to convert and enter your password to complete the conversion. The section :ref:`remote-authentication` has more specific information on converting to Institutional Log In, ORCID, GitHub, and Google.
pl: Jeśli dokonujesz przekształcenia z opcji logowania "Nazwa użytkownika/Email i hasło", kliknij "Zaloguj/Załóż konto" i przygotuj swoje hasło, aby dokończyć proces konwersji. Wybierz nową opcję logowania i przejdź przez cały proces. Po powrocie do repozytorium, pojawi się opcja pozwalająca na przekształcenie i wprowadzenie hasła i przekształcanie konta. Sekcja :ref:`remote-authentication` zawiera szczegółowe informacje na temat przekształcenia na logowanie instytucjonalne, a także logowanie poprzez ORCID, GitHub i Google.

source: If you need to perform any other conversion (e.g. from Google to GitHub), please contact the repository’s helpdesk.
pl: W przypadku konieczności przeprowadzenia konwersji innego rodzaju(np. z Google na GitHub), należy skontaktować się z pomocą repozytorium.

source: Reset Account Password
pl: Resetowanie hasła do konta

source: Only Dataverse accounts using the Username/Email log in option have an associated password stored (securely!) in Dataverse. If you don't remember this password, click on "Sign In/Sign Up" in the top right corner of any page, if necessary – click "Username/Email" button, and click the "Forgot Password?" link, where you would enter your username/email and password. Enter your email address and click "Submit Password Request" to receive an email with a link to reset your password.
pl: Tylko te konta w repozytorium, które korzystają z opcji logowania za pomocą nazwy użytkownika/e-maila mają przypisane hasło bezpiecznie przechowywane w repozytorium. Jeśli nie pamiętasz hasła, kliknij "Zaloguj/Załóż konto" w prawym górnym rogu dowolnej strony, jeśli to konieczne – kliknij przycisk "Nazwa użytkownika/E-mail", a następnie kliknij link "Nie pamiętasz hasła?". Wpisz swój adres e-mail i kliknij przycisk "Prześlij żądanie resetu hasła", aby otrzymać e-mail z linkiem do zresetowania hasła.

source: Please note that if you have forgotten your username, you can use this same process to receive your username in an email.
pl: Jeśli nie pamiętasz swojej nazwy użytkownika, możesz ją odzyskać w ten sam sposób.

source: Remote Authentication
pl: Zewnętrzne uwierzytelnianie

source: Too many passwords? You can set up your Dataverse account to use log in credentials from one of the following remote authentication providers. This way, you can log in using your existing credentials from another service.
pl: Masz za dużo haseł do zapamiętania? O ile pozwala na to konfiguracja konkretnej instalacji, konto w repozytorium można skonfigurować w taki sposób, by korzystało z danych uwierzytelniających od jednego z wybranych dostawców zewnętrznych. Dzięki temu możesz logować się przy użyciu danych uwierzytelniających istniejących już w innym serwisie.

source: Institutional log in allows you to use your log in information for your university (e.g. CAS at the University of Warsaw) to log in to your Dataverse account.
pl: Logowanie instytucjonalne umożliwia logowanie do konta w repozytorium z wykorzystaniem informacji uwierzytelniających, z których korzystasz na swojej uczelni.

source: Create a Dataverse account using Institutional Log In
pl: Tworzenie konta z wykorzystaniem logowania instytucjonalnego

source: Go to "Sign In/Sign Up" in the upper right corner of Dataverse.
pl: Kliknij "Zaloguj/Załóż konto" w prawym górnym rogu strony repozytorium.

source: Using the dropdown menu, select your institution then click the "Log In" button to go to your institution's log in page.
pl: Aby przejść do strony logowania swojej instytucji, wybierz ją w menu rozwijanym, a następnie kliknij przycisk "Zaloguj".

source: After you put in your institutional credentials successfully, you will be brought back to Dataverse to confirm your account information, and click "Create Account".
pl: Po pomyślnym wprowadzeniu instytucjonalnych danych uwierzytelniających nastąpi przeniesienie z powrotem do repozytorium w celu potwierdzenia danych konta. Następnie kliknij przycisk "Utwórz konto".

source: A username has been selected for you. You won't use this username to log in but it will appear next to your name when other users search for you to assign permissions within the system. To see what you username is, click on your name in the top right corner and click Account Information.
pl: Zostanie dla Ciebie wybrana nazwa użytkownika. Nie będziesz jej używał do logowania się, ale pojawi się ona obok Twojego nazwiska, gdy inni użytkownicy będą Cię szukać, aby przypisać Ci uprawnienia w repozytorium. Aby zobaczyć swoją nazwę użytkownika, kliknij na swoje imię i nazwisko w prawym górnym rogu, a następnie wybierz opcję "Informacje o koncie".

source: Convert your Dataverse account to use your Institutional Log In
pl: Przekształcanie konta na opcję logowania instytucjonalnego

source: If you already have a Dataverse account associated with the Username/Email log in option, but you want to convert it to use your institutional log in, you can easily do so as long as your account uses an email address from that institution. To do this:
pl: Jeśli posiadasz już konto w repozytorium wykorzystujące logowanie przy użyciu nazwy użytkownika/emaila oraz hasła, ale chcesz przekształcić je w konto wykorzystujące logowanie instytucjonalne, możesz to łatwo zrobić, pod warunkiem, że adres e-mail przypisany do Twojego konta jest zarazem adresem wykorzystywanym przez Twój instytucjonalny system uwierzytelniania. W tym celu:

source: Go to the Account Information page to confirm that your account email address is the same as your institutional email address. If not, you will need to update your Dataverse account to make them match.
pl: Przejdź do strony "Informacje o koncie", aby potwierdzić, że adres e-mail przypisany do Twojego konta jest tożsamy z Twoim adresem instytucjonalnym. Jeśli nie, konieczna będzie aktualizacja konta w repozytorium w taki sposób, aby oba adresy były zgodne.

source: Log out of Dataverse.
pl: Wyloguj się z repozytorium.

source: If necessary, select the "Your Institution" button under the "Other options" header.
pl: Jeśli to konieczne, wybierz przycisk "Twoja instytucja" pod nagłówkiem "Inne opcje".

source: Using the dropdown menu, select your institution then click the "Continue" button to go to your institution's log in page.
pl: Korzystając z menu rozwijanego, wybierz swoją instytucję, a następnie kliknij przycisk "Zaloguj", aby przejść do strony logowania Twojej instytucji.

source: After you put in your institutional credentials successfully, you will be brought back to Dataverse to confirm your account information.
pl: Po pomyślnym wprowadzeniu instytucjonalnych danych uwierzytelniających powrócisz do repozytorium w celu potwierdzenia informacji o Twoim koncie.

source: Enter your current password for your Dataverse account and click "Convert Account".
pl: Wprowadź swoje aktualne hasło do konta i kliknij "Przekształć konto".

source: Now you have finished converting your Dataverse account to use your institutional log in.
pl: Proces przekształcania konta w repozytorium zostanie zakończony. Od tego momentu możesz korzystać z logowania instytucjonalnego.

source: Convert your Dataverse account away from your Institutional Log In
pl: Przekształcenie konta wykorzystującego logowanie instytucjonalne

source: If you are leaving your institution and need to convert your Dataverse account to the Dataverse Username/Email log in option, you will need to contact support for the Dataverse installation you are using. In the header menu click "Support" and then "Contact Support". That will open a popup form to contact support for assistance.
pl: Jeśli rozstajesz się ze swoją instytucją, musisz przekształcić swoje konto w repozytorium w taki sposób, by odtąd wykorzystywało do logowania nazwę użytkownika/email oraz hasło. W tym celu skontaktuj się z obsługą techniczną repozytorium. Na górze dowolnej strony repozytorium kliknij "Pomoc", a następnie z menu rozwijanego wybierz opcję "Kontakt z pomocą repozytorium". Otworzy się formularz umożliwiający kontakt z pomocą techniczną repozytorium.

source: ORCID Log In
pl: Logowanie poprzez ORCID

source: If the configuration of a particular repository allows it, you can set up your Dataverse account to allow you to log in using your ORCID credentials. ORCID® is an independent non-profit effort to provide an open registry of unique researcher identifiers and open services to link research activities and organizations to these identifiers. Learn more at `orcid.org <http://orcid.org>`_.
pl: O ile pozwala na to konfiguracja konkretnego repozytorium, możesz skonfigurować swoje konto tak, aby logować się przy użyciu danych uwierzytelniających serwisu ORCID. ORCID® jest niezależnym, niekomercyjnym przedsięwzięciem mającym na celu zapewnienie otwartego rejestru unikalnych identyfikatorów badaczy oraz otwartych usług łączących te identyfikatory z działalnością badawczą i instytucjami naukowymi. Więcej informacji znajdziesz na stronie `orcid.org <http://orcid.org>`_.

source: Create a Dataverse account using ORCID
pl: Tworzenie konta wykorzystującego dane uwierzytelniające ORCID

source: Note: Only selected repository installations allow the creation of accounts using ORCID credentials.
pl: Uwaga: Jedynie wybrane instalacje repozytoriów pozwalając na tworzenie kont wykorzystujących dane uwierzytelniających ORCID.

source: Click the "ORCID" button under the "Other options" header.
pl: Kliknij przycisk "ORCID" znajdujący się pod nagłówkiem "Inne opcje".

source: Click the "Log In with ORCID" button to go to the ORCID website.
pl: Kliknij przycisk "Zaloguj się z ORCID", aby przejść na stronę serwisu ORCID.

source: If you do not already have an ORCID account, you can create one on this page. If you already have an ORCID account, click on "Sign in" and then enter your login under the "Personal account" tab.
pl: Jeśli nie posiadasz jeszcze konta w serwisie ORCID, możesz je założyć na tej stronie. Jeśli posiadasz już konto ORCID, kliknij "Sign in", a następnie wprowadź swój login w zakładce "Personal account".

source: After you put in your ORCID credentials successfully, you will be brought back to Dataverse to confirm the creation of your Dataverse account. If your ORCID account's privacy settings permit it, the email address you've linked to your ORCID account will be suggested to you as an option. You can use this email if you like, or you can use any other email you might wish. If you have entered employment information within your ORCID account, the name of your employer will be suggested for the "Affiliation" field.
pl: Po pomyślnym wprowadzeniu danych uwierzytelniających w serwisie ORCID nastąpi przekierowanie z powrotem do witryny repozytorium w celu potwierdzenia założenia konta. Jeśli ustawienia prywatności Twojego konta ORCID na to pozwalają, zostanie Ci zasugerowany jako opcja adres e-mail powiązany z kontem ORCID. Możesz użyć tego adresu poczty elektronicznej lub dowolnego innego adresu e-mail. Jeśli Twoje konto ORCID zawiera informacje dotyczące zatrudnienia, nazwa Twojego pracodawcy zostanie zasugerowana w polu "Afiliacja".

source: Convert your Dataverse account to use ORCID for log in
pl: Przekształcanie konta w celu logowania się przy użyciu danych uwierzytelniających ORCID

source: If you already have a Dataverse account associated with the Username/Email log in option, but you want to convert it to use ORCID for log in, follow these steps:
pl: Jeśli posiadasz już konto w repozytorium wykorzystujące logowanie za pomocą nazwy użytkownika/e-maila i hasła, ale chcesz korzystać z logowania przez ORCID, wykonaj poniższe kroki:

source: After you put in your ORCID credentials successfully, you will be brought back to Dataverse. Click the "convert your account" link.
pl: Po pomyślnym wprowadzeniu danych uwierzytelniających na stronie ORCID nastąpi przekierowanie z powrotem do repozytorium. Kliknij link "Przekształć swoje konto".

source: Enter your username and password for your Dataverse account and click "Convert Account".
pl: Wprowadź nazwę użytkownika i hasło do swojego konta w repozytorium i kliknij "Przekształć konto".

source: Now you have finished converting your Dataverse account to use ORCID for log in.
pl: Proces przekształcania zostanie zakończony. Od tej chwili możliwe będzie logowanie się do konta w repozytorium przez serwis ORCID

source: Convert your Dataverse account away from ORCID for log in
pl: Przekształcenie konta wykorzystującego logowanie za pomocą ORCID

source: If you don't want to log in to Dataverse using ORCID any more, you will want to convert your Dataverse account to the Dataverse Username/Email log in option. To do this, you will need to contact support for the Dataverse installation you are using. In the header menu click "Support" and then "Contact Support". This will open a popup form to contact support for assistance.
pl: Jeśli nie chcesz już logować się do repozytorium za pomocą serwisu ORCID i chcesz przekształcić swoje konto na takie, które wykorzystuje nazwę użytkownika/e-mail i hasło, skontaktuj się z obsługą techniczną repozytorium. W górnym menu kliknij "Pomoc", a następnie z menu rozwijanego wybierz opcję "Kontakt z pomocą repozytorium". Otworzy się formularz umożliwiający kontakt z pomocą techniczną repozytorium.

source: GitHub and Google Log In
pl: Logowanie przez GitHub i Google

source: You can also convert your Dataverse account to use authentication provided by GitHub or Google. These options may be found in the "Other options" section of the log in page, and function similarly to how ORCID is outlined above. If you would like to convert your account away from using one of these services for log in, then you can follow the same steps as listed above for converting away from the ORCID log in.
pl: O ile pozwala na to konfiguracja konkretnej instalacji, możesz również przekształcić swoje konto w repozytorium tak, by wyorzystywało ono logowanie przez GitHub lub Google. Opcje te można znaleźć w sekcji "Inne opcje" na stronie logowania. Działają one podobnie jak opisane powyżej logowanie przez ORCID. Jeśli chcesz przekształcić swoje konto na takie, które wykorzystuje logowanie za pomocą nazwy użytkownika/e-maila i hasła, wykonaj te same kroki, które zostały opisane powyżej w odniesieniu do konta wykorzystującego logowanie przez ORCID.

source: My Data
pl: Moje dane

source: The My Data section of your account page displays a listing of all the dataverses, datasets, and files you have either created, uploaded or that you have access to edit. You are able to filter through all the dataverses, datasets, and files listed there using the filter box. You may also use the facets on the left side to only view a specific Publication Status or Role.
pl: W zakładce "Moje dane" na stronie Twojego konta znajduje się lista wszystkich kolekcji, zbiorów danych i plików, które zostały przez Ciebie utworzone, przesłane lub które możesz edytować. Za pomocą pola "Szukaj w moich danych" możesz przeszukać wszystkie widoczne tam kolekcje, zbiory danych i pliki. Możesz również użyć filtrów znajdujących się po lewej stronie, aby ograniczyć wyniki w zależności od statusu opublikowania lub posiadanej przez Ciebie roli.

source: Notifications
pl: Powiadomienia

source: Notifications appear in the notifications tab on your account page and are also displayed as a number next to your name.
pl: Powiadomienia są widoczne w zakładce "Powiadomienia" na stronie Twojego konta. Ich liczba jest również wyświetlana obok Twojego imienia i nazwiska.

source: You will receive a notification when:
pl: Otrzymasz powiadomienie, jeśli:

source: You've created your account, or
pl: Utworzysz konto.

source: You've created a dataverse or added a dataset, or
pl: Utworzysz kolekcję lub dodasz zbiór danych.

source: Another Dataverse user has requested access to a restricted file in one of your datasets.
pl: Inny użytkownik repozytorium poprosi o dostęp do zastrzeżonego pliku w jednym z Twoich zbiorów danych.

source: Notifications will only be emailed one time even if you haven't read the notification on the Dataverse site.
pl: Powiadomienia będą też wysyłane na Twój adres e-mail. Każde powiadomienie zostanie wysłane w ten sposób tylko raz, nawet jeśli nie przeczytasz powiadomienia na stronie repozytorium.

source: API Token
pl: Token API

source: To create your API token, click on your name in the header on the right hand side and then click on API Token.
pl: Aby utworzyć token API, kliknij swoje imię i nazwisko w prawym górnym rogu strony repozytorium, a następnie wybierz opcję "Token API".

source: In this tab, you can create your API Token for the first time as well as recreate it if you need a new API Token or if your API Token becomes compromised.
pl: W tej zakładce możesz utworzyć swój token API, jak również utworzyć go ponownie, jeśli potrzebujesz nowego tokena API lub jeśli Twój obecny token API dostał się w niepowołane ręce.
