Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/appendix.po
Languages: pl

source: Appendix
pl: Dodatek

source: Additional documentation complementary to the User Guide.
pl: Dodatkowa dokumentacja uzupełniająca "Podręcznik użytkownika".

source: |toctitle|
pl: Zawartość:

source: Metadata References
pl: Bibliografia do metadanych

source: Dataverse is committed to using standard-compliant metadata to ensure that Dataverse metadata can be mapped easily to standard metadata schemas and be exported into JSON format (XML for tabular file metadata) for preservation and interoperability.
pl: Dataverse zobowiązuje się stosować metadane zgodne ze standardami, aby zapewnić ich łatwe mapowanie metadanych Dataverse na standardowe schematy metadanych i eksportowanie do formatu JSON (XML w przypadku metadanych plików tabelarycznych), aby umożliwić ich trwałe przechowywanie i zapewnić interoperacyjność.

source: Detailed below are what metadata schemas we support for Citation and Domain Specific Metadata in Dataverse:
pl: Poniżej wyszczególniono schematy metadanych, które obsługujemy do cytowania i metadanych specyficznych dla domeny w Dataverse:

source: **Citation Metadata:** compliant with `DDI Lite <http://www.ddialliance.org/specification/ddi2.1/lite/index.html>`_, `DDI 2.5 Codebook <http://www.ddialliance.org/>`__, `DataCite 4.4 <https://schema.datacite.org/meta/kernel-4.4/doc/DataCite-MetadataKernel_v4.4.pdf>`__, and Dublin Core's `DCMI Metadata Terms <http://dublincore.org/documents/dcmi-terms/>`__. Language field uses `ISO 639-1 <https://www.loc.gov/standards/iso639-2/php/English_list.php>`__ controlled vocabulary.
pl: **Metadane cytowania:** zgodne z `DDI Lite <http://www.ddialliance.org/specification/ddi2.1/lite/index.html>`_, `DDI 2.5 Codebook <http://www.ddialliance.org/>`_, `DataCite 4.4 <https://schema.datacite.org/meta/kernel-4.4/doc/DataCite-MetadataKernel_v4.4.pdf>`_ oraz `warunkami metadanych DCMI Dublin Core <http://dublincore.org/documents/dcmi-terms/>`_. Pola dotyczące języka używają słownika kontrolowanego zgodnego z `ISO 639-1. <https://www.loc.gov/standards/iso639-2/php/English_list.php>`_

source: **Geospatial Metadata:** compliant with DDI Lite, DDI 2.5 Codebook, DataCite, and Dublin Core. Country / Nation field uses `ISO 3166-1 <http://en.wikipedia.org/wiki/ISO_3166-1>`_ controlled vocabulary.
pl: **Metadane geoprzestrzenne:** zgodne z DDI Lite, DDI 2.5 Codebook, DataCite i Dublin Core. Pole "Kraj lub państwo" używa słownika kontrolowanego zgodnego z `ISO 3166-1 <https://www.loc.gov/standards/iso639-2/php/English_list.php>`_.

source: **Social Science & Humanities Metadata:** compliant with DDI Lite, DDI 2.5 Codebook, and Dublin Core.
pl: **Metadane dla nauk społecznych i humanistycznych:** zgodny z DDI Lite, DDI 2.5 Codebook i Dublin Core.

source: **Astronomy and Astrophysics Metadata:** These metadata elements can be mapped/exported to the International Virtual Observatory Alliance’s (IVOA) `VOResource Schema format <http://www.ivoa.net/documents/latest/RM.html>`__ and is based on `Virtual Observatory (VO) Discovery and Provenance Metadata <http://perma.cc/H5ZJ-4KKY>`__.
pl: Metadane astronomiczne i astrofizyczne: Te elementy metadanych mogą być mapowane / eksportowane do formatu International Virtual Observatory Alliance (IVOA) `VOResource Schema <http://www.ivoa.net/documents/latest/RM.html>`__, który jest oparty na `Virtual Observatory (VO) Discovery and Provenance Metadata <http://perma.cc/H5ZJ-4KKY>`__.

source: **Life Sciences Metadata:** based on `ISA-Tab Specification <https://isa-specs.readthedocs.io/en/latest/isamodel.html>`__, along with controlled vocabulary from subsets of the `OBI Ontology <http://bioportal.bioontology.org/ontologies/OBI>`__ and the `NCBI Taxonomy for Organisms <http://www.ncbi.nlm.nih.gov/Taxonomy/taxonomyhome.html/>`__.
pl: **Metadane dla nauk przyrodniczych:** oparte na `ISA-Tab-Specification <https://isa-specs.readthedocs.io/en/latest/isamodel.html>`_, wraz z kontrolowanym słownikiem z podzbiorów `OBI-Ontology <http://bioportal.bioontology.org/ontologies/OBI>`_ i `NCBI-Taxonomy for Organisms <http://www.ncbi.nlm.nih.gov/Taxonomy/taxonomyhome.html/>`_.
