Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/dataverse-management.po
Languages: pl

source: Dataverse Management
pl: Zarządzanie kolekcją

source: A dataverse is a container for datasets (research data, code, documentation, and metadata) and other dataverses, which can be setup for individual researchers, departments, journals and organizations.
pl: Kolekcja może zawierać zbiory danych (dane badawcze, kod, dokumentację i metadane) oraz inne kolekcje, które mogą być konfigurowane zgodnie z potrzebami poszczególnych badaczy, wydziałów, czasopism i organizacji.

source: Schematic Diagram of Dataverse
pl: Schematyczny diagram kolekcji

source: Schematic diagram of a Dataverse in *Dataverse 4.0*. Dataverse is a container for Datasets and other Dataverses.
pl: Schematyczny diagram kolekcji w *Dataverse*. Kolekcja może zawierać zbiory danych lub inne kolekcje.

source: Once a user creates a dataverse they, by default, become the administrator of that dataverse. The dataverse administrator has access to manage the settings described in this guide.
pl: Gdy użytkownik utworzy kolekcję, automatycznie staje się jej administratorem. Administrator kolekcji może zarządzać ustawieniami, które opisane zostały w niniejszym przewodniku.

source: |toctitle|
pl: Zawartość:

source: Create a Dataverse (Within the "Root" Dataverse)
pl: Tworzenie kolekcji (w obrębie kolekcji głównej repozytorium)

source: Creating a dataverse is easy but first you must be a registered user (see :doc:`/user/account`).
pl: Utworzenie kolekcji jest łatwe, najpierw jednak trzeba utworzyć swoje konto w repozytorium (patrz :doc:`/user/account`).

source: Once you are logged in click on the "Add Data" button and in the dropdown menu select "New Dataverse".
pl: Po zalogowaniu kliknij przycisk "Dodaj dane" i w menu rozwijanym wybierz "Nowa kolekcja".

source: Once on the "New Dataverse" page fill in the following fields [#f1]_ :
pl: Na stronie "Nowa kolekcja" wypełnij następujące pola [#f1]_ :

source: **Name**: Enter the name of your dataverse.
pl: **Nazwa**: Wpisz nazwę swojej kolekcji.

source: **Identifier**: This is an abbreviation, usually lower-case, that becomes part of the URL for the new dataverse. Special characters (~,\`, !, @, #, $, %, ^, &, and \*) and spaces are not allowed. **Note**: if you change the Dataverse Identifier field, the URL for your Dataverse changes (http//.../'url'), which affects links to this page.
pl: **Identyfikator**: Jest to skrót, pisany zazwyczaj małymi literami, który staje się częścią adresu URL nowej kolekcji. Znaki specjalne (~,\`, !, @, #, $, %, ^, &, i \*) oraz spacje są niedozwolone. **Uwaga**: jeśli zmienisz pole "Identyfikator" kolekcji, zmieni się jej adres URL(http//.../"url"), co ma wpływ na linki do tej strony.

source: **Email**: This is the email address that will be used as the contact for this particular dataverse. You can have more than one contact email address for your dataverse.
pl: **Email**: Jest to adres, który będzie używany jako e-mail do kontaktu dla tej kolekcji. Dla danej kolekcji można podać więcej niż jeden adres e-mail do kontaktu

source: **Affiliation**: Add any Affiliation that can be associated to this particular dataverse (e.g., project name, institute name, department name, journal name, etc). This is automatically filled out if you have added an affiliation for your user account.
pl: **Afiliacja**: Dowolna afiliacja, która może być związana z tą kolekcją (np. nazwa projektu, nazwa instytutu, nazwa wydziału, nazwa czasopisma itp.). Jest ona automatycznie wypełniana, jeśli dodano afiliację do konta osoby zakładającej daną kolekcję.

source: **Description**: Provide a description of this dataverse. This will display on the home page of your dataverse and in the search result list.
pl: **Opis**: Opis tej kolekcji. Zostanie on wyświetlony na stronie głównej kolekcji oraz na liście wyników wyszukiwania.

source: **Category**: Select a category that best describes the type of dataverse this will be. For example, if this is a dataverse for an individual researcher's datasets, select Researcher. If this is a dataverse for an institution, select Organization & Institution.
pl: **Kategoria**: Typ kolekcji. Na przykład, jeśli jest to kolekcja dla zbiorów danych pojedynczego badacza lub pojedynczej badaczki, wybierz "Badacz/Badaczka". Jeśli jest to kolekcja dla instytucji, wybierz "Organizacja lub instytucja".

source: **Choose the sets of Metadata Elements for datasets in this dataverse**: By default the metadata elements will be from the host dataverse that this new dataverse is created in. Dataverse offers metadata standards for multiple domains. To learn more about the metadata standards in Dataverse please check out the :doc:`/user/appendix`.
pl: **Zestawy metadanych dla zbiorów danych w tej kolekcji**: Domyślnie elementy metadanych będą pochodzić z kolekcji nadrzędnej, w której nowa kolekcja została utworzona. Repozytorium oferuje standardy metadanych dla wielu dziedzin. Aby dowiedzieć się więcej o standardach metadanych, zob. poświęcony im :doc:`/user/appendix`.

source: **Select facets for this dataverse**: by default the facets that will appear on your dataverse landing page will be from the host dataverse that this new dataverse was created in. The facets are simply metadata fields that can be used to help others easily find dataverses and datasets within this dataverse. You can select as many facets as you would like.
pl: **Filtry dla tej kolekcji**: Domyślne filtry, które pojawią się na stronie Twojej kolekcji będą pochodzić z kolekcji nadrzędnej, w której nowa kolekcja została utworzona. Filtry to po prostu pola metadanych, które pomagają w odnalezieniu zarówno samej kolekcji, jak i znajdujących się w niej zbiorów danych. Można wybrać dowolną liczbę filtrów.

source: Selected metadata elements are also used to pick which metadata fields you would like to use for creating templates for your datasets. Metadata fields can be hidden, or selected as required or optional. Once you have selected all the fields you would like to use, you can create your template(s) after you finish creating your dataverse.
pl: Wybrane elementy schematów metadanych można wykorzystać przy tworzeniu szablonów zbiorów danych. Pola metadanych mogą być ukryte, wymagane lub opcjonalnie. Po wybraniu pól metadanych i utworzeniu kolekcji, można utworzyć szablony zbioru danych.

source: Click "Create Dataverse" button and you're done!
pl: Teraz wystarczy kliknąć przycisk "Utwórz kolekcję" i gotowe!

source: Required fields are denoted by a red asterisk.
pl: Pola wymagane oznaczone są czerwoną gwiazdką.

source: Edit Dataverse
pl: Edycja kolekcji

source: To edit your dataverse, navigate to your dataverse homepage and select the "Edit Dataverse" button, where you will be presented with the following editing options:
pl: Aby edytować kolekcję, przejdź do jej strony i wybierz przycisk "Edytuj". Dostępne będą następujące opcje edycji:

source: :ref:`general-information`: edit name, identifier, category, contact email, affiliation, description, Metadata Elements, and facets for your dataverse
pl: :ref:`general-information`: pozwala edytować nazwę, identyfikator, kategorię, e-mail do kontaktu, afiliację, opis, elementy metadanych i filtry kolekcji.

source: :ref:`Theme <theme>`: upload a logo for your dataverse, add a link to your department or personal website, and select colors for your dataverse in order to brand it
pl: :ref:`Wygląd <theme>`: pozwala przesłać logo kolekcji, dodać link do strony wydziału lub własnej strony internetowej i wybrać dla swojej kolekcji kolory, które pozwolą ją wyróżnić

source: :ref:`Widgets <dataverse-widgets>`: get code to add to your website to have your dataverse display on it
pl: :ref:`Widżety <dataverse-widgets>`: pozwala uzyskać kod, który można dodać do swojej własnej strony internetowej, aby wyświetlić na niej swoją kolekcję.

source: :ref:`Permissions <dataverse-permissions>`: give Dataverse users permissions to your dataverse, i.e.-can edit datasets, and see which users already have which permissions for your dataverse
pl: :ref:`Uprawnienia <dataverse-permissions>`: pozwala nadać użytkownikom repozytorium uprawnienia do kolekcji – np. dać możliwość edycji zbiorów danych – sprawdzić, którzy użytkownicy mają już uprawnienia do tej kolekcji.

source: :ref:`Dataset Templates <dataset-templates>`: these are useful when you have several datasets that have the same information in multiple metadata fields that you would prefer not to have to keep manually typing in
pl: :ref:`Szablony zbiorów danych <dataset-templates>`: są one przydatne, gdy trzeba utworzyć kilka zbiorów danych, które w wielu polach metadanych mają te same informacje. Dzięki szablonom nie trzeba wielokrotnie wpisywać ich ręcznie

source: :ref:`Dataset Guestbooks <dataset-guestbooks>`: allows you to collect data about who is downloading the files from your datasets
pl: :ref:`Księga gości zbioru danych<dataset-guestbooks>`: pozwala na gromadzenie danych o tym, kto pobiera pliki ze zbioru danych.

source: :ref:`Featured Dataverses <featured-dataverses>`: if you have one or more dataverses, you can use this option to show them at the top of your dataverse page to help others easily find interesting or important dataverses
pl: :ref:`Wyróżnione kolekcje<featured-dataverses>`: jeśli w kolekcji znajduje się jedna lub więcej kolekcji podrzędnych, można użyć tej opcji, aby wyróżnić je na górze strony kolekcji i pomóc innym łatwo znaleźć interesujące lub ważne kolekcje.

source: **Delete Dataverse**: you are able to delete your dataverse as long as it is not published and does not have any draft datasets
pl: **Usuwanie kolekcji**: można usunąć swoją kolekcję, o ile nie jest ona opublikowana i nie zawiera żadnych wersji roboczych zbiorów danych.

source: General Information
pl: Informacje ogólne

source: The General Information page is how you edit the information you filled in while creating your dataverse. If you need to change or add a contact email address, this is the place to do it. Additionally, you can update the metadata elements used for datasets within the dataverse, change which metadata fields are hidden, required, or optional, and update the facets you would like displayed for browsing the dataverse. If you plan on using templates, you need to select the metadata fields on the General Information page.
pl: Na stronie "Informacje ogólne" można edytować informacje podane podczas tworzenia kolekcji. Jest to właściwe miejsce, aby zmienić lub dodać kontaktowy adres e-mail. Można też zaktualizować elementy schematów metadanych używane dla zbiorów danych w kolekcji, określić, które pola metadanych są ukryte, wymagane lub opcjonalne oraz zaktualizować filtry, które będą wyświetlane podczas przeglądania kolekcji. Aby skorzystać z szablonów, należy wybrać odpowiednie pola metadanych na stronie "Informacje ogólne".

source: Tip: The metadata fields you select as required will appear on the Create Dataset form when someone goes to add a dataset to the dataverse.
pl: Wskazówka: Pola metadanych, które zostały określone jako wymagane, pojawią się na formularzu tworzenia zbioru danych widocznym w momencie dodawania go do kolekcji.

source: Theme
pl: Wygląd

source: The Theme feature provides you with a way to customize the look of your dataverse. You can decide either to use the theme from the dataverse containing your dataverse (even up to the root dataverse, AKA the homepage), or upload your own image file. Supported image types are JPEG, TIFF, or PNG and should be no larger than 500 KB. The maximum display size for an image file in a dataverse's theme is 940 pixels wide by 120 pixels high. Additionally, you can select the colors for the header of your dataverse and the text that appears in your dataverse. You can also add a link to your personal website, the website for your organization or institution, your department, journal, etc.
pl: Można również dostosować wygląd swojej kolekcji i określić, czy użyty zostanie wygląd kolekcji nadrzędnych zawierających zawierającej daną kolekcję (w górę drzewa kolekcji, aż do kolekcji głównej, czyli strony głównej repozytorium), czy też przesłane zostaną własne plik graficzny. Obsługiwane typy obrazów to JPEG, TIFF lub PNG. Nie powinny być one większe niż 500 KB. Maksymalny rozmiar wyświetlania obrazu to 940 pikseli szerokości i 120 pikseli wysokości. Dodatkowo możesz wybrać kolory nagłówka i tekstu twojej kolekcji. Możesz również dodać link do swojej osobistej strony internetowej, strony internetowej swojej organizacji lub instytucji, swojego wydziału, czasopisma itp.

source: Widgets
pl: Widżety

source: The Widgets feature provides you with code for you to put on your personal website to have your dataverse displayed there. There are two types of Widgets for a dataverse, a Dataverse Search Box widget and a Dataverse Listing widget. From the "Widgets" tab on the "Theme + Widgets" page, you can copy and paste the code snippets for the widget you would like to add to your website. If you need to adjust the height of the widget on your website, you may do so by editing the ``heightPx=500`` parameter in the code snippet.
pl: Widżety to niewielkie fragmenty kodu, które można umieścić na swojej stronie internetowej, aby wyświetlić na niej swoją kolekcję. Dostępne są dwa rodzaje widżetów: formularz wyszukiwania i widżet wyświetlający zawartość kolekcji. Kod widżetu do umieszczenia na stronie można skopiować z zakładki "Widżety" na stronie "Wygląd + Widżety". Aby dostosować wysokość widżetu, należy dokonać w kodzie edycji parametru ``heightPx=500``.

source: Dataverse Search Box Widget
pl: Widżet pozwalający na wyszukiwanie w kolekcji

source: The Dataverse Search Box Widget will add a search box to your website that is linked to your dataverse. Users are directed to your dataverse in a new browser window, to display the results for search terms entered in the input field.
pl: Widżet wyszukiwania pozwala osadzić na stronie internetowej formularz wyszukiwania w danej kolekcji. Wyniki wyszukiwania są wyświetlane w nowym oknie przeglądarki

source: Dataverse Listing Widget
pl: Widżet pozwalający wyświetlić zawartość kolekcji

source: The Dataverse Listing Widget provides a listing of all your dataverses and datasets for users to browse, sort, filter and search. When someone clicks on a dataverse or dataset in the widget, it displays the content in the widget on your website. They can download data files directly from the datasets within the widget. If a file is restricted, they will be directed to your dataverse to log in, instead of logging in through the widget on your website.
pl: Widżet ten pozwala wyświetlić listę wszystkich kolekcji podrzędnych oraz zbiorów danych w danej kolekcji, umożliwiając ich przeglądanie, sortowanie, filtrowanie i przeszukiwanie. Gdy ktoś kliknie na kolekcję lub zbiór danych w widżecie, wynik wyświetli się w obrębie widżetu na stronie internetowej. Możliwe jest również pobieranie plików danych bezpośrednio z widżetu. Jeśli dostęp do pliku jest ograniczony, użytkownik zostanie przekierowany do kolekcji, aby najpierw zalogować się na konto z odpowiednimi uprawnieniami.

source: Roles & Permissions
pl: Role i uprawnienia

source: Dataverse user accounts can be granted roles that define which actions they are allowed to take on specific dataverses, datasets, and/or files. Each role comes with a set of permissions, which define the specific actions that users may take.
pl: W repozytorium kontom użytkowników można przypisywać role. Rola określa, jakie działania może podejmować użytkownik w odniesieniu do wskazanych kolekcji, zbiorów danych i/lub plików. Z każdą rolą związany jest zestaw uprawnień określających jakie działania mogą podejmować użytkownicy.

source: Roles and permissions may also be granted to groups. Groups can be defined as a collection of Dataverse user accounts, a collection of IP addresses (e.g. all users of a library's computers), or a collection of all users who log in using a particular institutional login (e.g. everyone who logs in with a particular university's account credentials).
pl: Role i uprawnienia mogą być przyznawane również grupom. Grupy można zdefiniować jako zbiór kont użytkowników repozytorium, zbiór adresów IP (np. wszyscy użytkownicy komputerów w sieci biblioteki) lub zbiór wszystkich użytkowników, którzy logują się z konkretnej instytucji za pomocą logowania federacyjnego.

source: Admins of a dataverse can assign roles and permissions to the users of that dataverse. If you are an admin on a dataverse, then you will find the link to the Permissions page under the Edit dropdown on the dataverse page.
pl: Role i związane z nimi uprawnienia mogą przyznawać administratorzy kolekcji. Jeśli jesteś administratorem kolekcji, link do strony "Uprawnienia" znajdziesz na stronie kolekcji, w menu rozwijanym pod przyciskiem "Edytuj".

source: Permissions link highlighted
pl: Pośdwietlony link do uprawnień

source: Screenshot of dataverse page with highlighted Permissions link location.
pl: Zrzut ekranu podstrony repozytorium z podświetlonym linkiem do uprawnień.

source: Clicking on Permissions will bring you to the page presented in :numref:`dvperms2`:
pl: Kliknięcie na "Uprawnienia" spowoduje przeniesienie na tę stronę:

source: Permissions page
pl: Strona uprawnień

source: Screenshot of dataverse Permissions page.
pl: Zrzut ekranu prezentujący stronę uprawnień.

source: When you access a dataverse's permissions page, you will see three sections:
pl: Na stronie "Uprawnienia" znajdziesz trzy sekcje:

source: **Permissions:** Here you can decide the requirements that determine which types of users can add datasets and sub dataverses to your dataverse, and what permissions they'll be granted when they do so.
pl: **Uprawnienia:** Tu można określić jacy użytkownicy mogą dodawać zbiory danych i kolekcje podrzędne do danej kolekcji, oraz jaki otrzymają w odniesieniu do nich zakres uprawnień.

source: **Users/Groups:** Here you can assign roles to specific users or groups, determining which actions they are permitted to take on your dataverse. You can also reference a list of all users who have roles assigned to them for your dataverse and remove their roles if you please.
pl: **Użytkownicy/Grupy:** Tutaj można przypisać role konkretnym użytkownikom lub grupom, określając, jakie działania będą mogli podejmować w kolekcji. Możesz również wykorzystać listę wszystkich użytkowników, którzy mają przypisane role w danej kolekcji i odebrać je, jeśli zajdzie taka potrzeba.

source: **Roles:** Here you can reference a full list of roles that can be assigned to users of your dataverse. Each role lists the permissions that it offers.
pl: Tutaj znajdziesz pełną listę ról, które mogą być przyznane użytkownikom danej kolekcji. Każda rola zawiera listę związanych z nią uprawnień

source: Please note that even on a newly created dataverse, you may see user and groups have already been granted role(s) if your installation has ``:InheritParentRoleAssignments`` set. For more on this setting, see the :doc:`/installation/config` section of the Installation Guide.
pl: Zauważyć należy, że jeśli w konfiguracji Repozytorium włączone zostało dziedziczenie ról (opcja ``:InheritParentRoleAssignments``), nawet w nowo utworzonej kolekcji znajdą się użytkownicy i grupy, którym przyznano już role. Więcej informacji na temat tego ustawienia znajduje się w sekcji :doc:`/installation/config` w Podręczniku instalacji.

source: Setting Access Configurations
pl: Konfiguracja dostępu

source: Under the Permissions tab, you can click the "Edit Access" button to open a box where you can specify who can add dataverses and datasets to your dataverse and what permissions are granted to those users.
pl: W zakładce "Uprawnienia" kliknięcie przycisku "Edytuj dostęp" otwiera okno, które pozwala określić, kto może dodawać kolekcje i zbiory danych do tej kolekcji oraz jakie uprawnienia otrzymają ci użytkownicy.

source: Edit Access modal
pl: Okno modalne edycji uprawnień dostępu

source: Screenshot of Edit Access modal window.
pl: Zrzut ekranu prezentujący okno modalne edycji uprawnień dostępu.

source: The first question on this page allows you to determine how open your dataverse is to new additions - you can set whether or not the entire userbase (all logged in users) has the ability to add datasets or sub dataverses to your dataverse.
pl: Pierwsza opcja na tej stronie pozwala określić, w jakim stopniu Twoja kolekcja będzie otwarta na nowe elementy. Można tu określić, czy wszyscy zalogowani użytkownicy będą mogli dodawać do danej kolekcji zbiory danych i kolekcje podrzędne.

source: The second question on this page allows you to choose the role (and thus the permissions) granted to users who add a dataset to your dataverse. The role you select will be automatically granted to any user who creates a dataset on your dataverse, on that dataset, at the moment that he or she creates it. The role the user is given determines his or her permissions for the dataset they've created. The key difference between the three roles is that curators can publish their own datasets, while contributors and depositors must submit the dataset to be reviewed before publication. Additionally, curators and depositors can manage dataset permissions. Note that this setting does not retroactively apply roles to users who have previously added datasets to your dataverse; it only applies to users adding new datasets going forward.
pl: Druga opcja na tej stronie pozwala na wybór roli, a tym samym uprawnień, przyznawanych użytkownikom, którzy dodadzą zbiory danych do danej kolekcji. Każdemu użytkownikowi, który utworzy zbiór danych w kolekcji, w odniesieniu do tego zbioru danych zostanie automatycznie przyznana wskazana rola. Rola, jaką otrzymuje użytkownik określa jego uprawnienia do utworzonego przez niego zbioru danych. Kluczowa różnica między rolą kontrybutora rolą deponenta a rolą kuratora polega na tym, że kuratorzy mogą publikować swoje zbiory danych, podczas gdy kontrybutorzy i deponenci muszą przesłać zbiór danych do weryfikacji przed publikacją. Dodatkowo, kuratorzy i deponenci mogą zarządzać uprawnieniami do zbioru danych. Zauważyć trzeba, że to ustawienie nie działa wstecz, tj. nie odnosi się do osób, które wcześniej dodały zbiory do danej kolekcji, a jedynie do tych użytkowników którzy w przyszłości dodadzą nowe zbiory danych.

source: Both of these settings can be changed at any time.
pl: Oba te ustawienia mogą być zmienione w dowolnym momencie.

source: Assigning Roles to Users and Groups
pl: Przypisywanie ról użytkownikom i grupom
