Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/dataset-management.po
Languages: pl

source: Dataset + File Management
pl: Zbiór danych + zarządzanie plikami

source: A dataset in Dataverse is a container for your data, documentation, code, and the metadata describing this Dataset.
pl: Na zbiór danych w repozytorium składają się dane, dokumentacja, kod i opisujące ten zbiór metadane.

source: Schematic Diagram of a Dataset
pl: Schemat zbioru danych

source: Schematic diagram of a Dataset in *Dataverse*. Dataset is a container for your data, documentation and code.
pl: Schemat zbioru danych w systemie *Dataverse*. Na zbiór danych w repozytorium składają się dane, dokumentacja i kod.

source: |toctitle|
pl: Zawartość:

source: Supported Metadata
pl: Wspierane metadane

source: A dataset contains three levels of metadata:
pl: Zbiór danych zawiera trzy poziomy metadanych:

source: **Citation Metadata**: any metadata that would be needed for generating a data citation and other general metadata that could be applied to any dataset;
pl: **Metadane cytowania**: wszelkie metadane potrzebne do utworzenia cytowania danych oraz inne metadane o charakterze ogólnym, które można zastosować do dowolnego zbioru danych;

source: **Domain Specific Metadata**: with specific support currently for Social Science, Life Science, Geospatial, and Astronomy datasets; and
pl: **Metadane specyficzne dla danej dziedziny**: obecnie wspierane są metadane geoprzestrzenne oraz metadane dla nauk społecznych, nauk przyrodniczych oraz astronomii.

source: **File-level Metadata**: varies depending on the type of data file - for more details see :ref:`file-handling` section).
pl: Metadane na poziomie plików: różnią się w zależności od typu pliku danych - więcej szczegółów znajduje się w sekcji :ref:`file-handling`.

source: For more details about what Citation and Domain Specific Metadata is supported please see our :ref:`user-appendix`.
pl: By znaleźć więcej szczegółów na temat tego, jakie metadane cytowania oraz metadane dziedzinowe są obecnie wspierane, zobacz nasz :ref:`user-appendix`.

source: Supported Metadata Export Formats
pl: Wspierane formaty eksportu metadanych

source: Note that once a dataset has been published its metadata is exported in a variety of formats. A button on the dataset page's metadata tab will allow a user to export the metadata of the most recently published version of the dataset. Currently supported export formats are Datacite, DDI, Dublin Core, Schema.org JSON-LD, OpenAIRE, and Dataverse’s native JSON format.
pl: Po opublikowaniu zbioru danych jego metadane można wyeksportować. Przycisk na zakładce metadanych na stronie zbioru pozwala użytkownikowi na wyeksportowanie metadanych z ostatnio opublikowanej wersji zbioru. Obecnie obsługiwane są następujące formaty eksportu: Datacite, DDI, Dublin Core, Schema.org, JSON-LD, OpenAIRE oraz natywny format JSON.

source: Adding a New Dataset
pl: Dodawanie nowego zbioru danych

source: Navigate to the dataverse in which you want to add a dataset.
pl: Przejdź do kolekcji, w której chcesz dodać zbiór danych

source: Click on the "Add Data" button and select "New Dataset" in the dropdown menu.
pl: Kliknij przycisk "Dodaj dane" i w menu rozwijanym wybierz "Nowy zbiór danych".

source: To quickly get started, enter at minimum all the required fields with an asterisk (e.g., the Dataset Title, Author, Description, Contact Email and Subject) to get a Data Citation with a DOI.
pl: Wypełnij co najmniej wszystkie pola wymagane – są one oznaczone gwiazdką (np. tytuł zbioru danych, autor, opis, e-mail osoby do kontaktu i obszar tematyczny). Dzięki temu możliwe będzie utworzenie sugerowanego cytowania zbioru danych i przypisanie do niego identyfikatora DOI.

source: Scroll down to the "Files" section and click on "Select Files to Add" to add all the relevant files to your Dataset. In some repositories you can also upload your files directly from your Dropbox. **Tip:** You can drag and drop or select multiple files at a time from your desktop directly into the upload widget. Your files will appear below the "Select Files to Add" button where you can add a description and tags (via the "Edit Tag" button) for each file. Additionally, an MD5 checksum will be added for each file. If you upload a tabular file a :ref:`Universal Numerical Fingerprint (UNF) <unf>` will be added to this file.
pl: Przejdź w dół do sekcji "Pliki" i kliknij na "Wybierz pliki do dodania", aby dodać pliki do swojego zbioru danych. Jeśli pozwala na to konfiguracja repozytorium, możesz również przesyłać pliki bezpośrednio z serwisu Dropbox. Wskazówka: Pliki możesz dodać metodą "przeciągnij i upuść". Możesz też wybrać naraz wiele plików znajdujących się na Twoim komputerze. Twoje pliki pojawią się poniżej przycisku "Wybierz pliki do dodania". W tym miejscu gdzie możesz dodać opis i tagi (za pomocą przycisku "Edytuj" wybierając opcję "Tagi") dla każdego pliku. Dodatkowo, do każdego pliku zostanie przypisana suma kontrolna MD5. W przypadku przesłania pliku tabelarycznego do tego pliku zostanie dodany uniwersalny odcisk numeryczny :ref:`Universal Numerical Fingerprint (UNF) <unf>`.

source: Click the "Save Dataset" button when you are done. Your unpublished dataset is now created.
pl: Gdy skończysz, kliknij przycisk "Zapisz zbiór danych". Utworzona zostanie nieopublikowana wersja robocza zbioru.

source: You can add additional metadata once you have completed the initial dataset creation by going to Edit Dataset > Metadata.
pl: **Uwaga:** Dodatkowe metadane można dodać już po utworzeniu pierwszej wersji roboczej zbioru danych. W tym celu należy kliknąć przycisk "Edytuj" i wybrać pozycję "Metadane".

source: File Upload
pl: Przesyłanie plików

source: The Dataverse software offers multiple methods of uploading files to a dataset. These upload methods are configurable by the administrator of a Dataverse installation, so you might not see some of these options on the Dataverse site you're using.
pl: Oprogramowanie repozytorium oferuje wiele metod przesyłania plików do zbioru danych. Udostępnienie poszczególnych metod zależy od konfiguracji konkretnego repozytorium , więc nie wszystkie z wymienionych opcji muszą być widoczne w danej instalacji

source: If there are multiple upload options available, then you must choose which one to use for your dataset. A dataset may only use one upload method. Once you upload a file using one of the available upload methods, that method is locked in for that dataset.
pl: Jeśli dostępnych jest wiele opcji przesyłania danych, można wybrać, które z nich zostaną użyte w przypadku danego zbioru. Zbiór danych może używać tylko jednej metody przesyłania. Po przesłaniu pliku przy użyciu jednej z dostępnych metod przesyłania, metoda ta zostaje przypisana na stałe do tego zbioru

source: You can upload files to a dataset while first creating that dataset. You can also upload files after creating a dataset by clicking the "Edit" button at the top of the dataset page and from the dropdown list selecting "Files (Upload)" or clicking the "Upload Files" button above the files table in the Files tab. From either option you will be brought to the Upload Files page for that dataset.
pl: Możesz przesłać pliki do zbioru danych podczas jego tworzenia. Możesz również przesłać je już po jego utworzeniu klikając przycisk "Edytuj" na górze strony zbioru danych i wybierając z listy rozwijanej "Pliki (przesyłanie)" lub klikając przycisk "Prześlij pliki" nad tabelą plików w zakładce "Pliki". W obu przypadkach nastąpi przekierowanie na stronę przesyłania plików tego zbioru danych.

source: Certain file types in Dataverse are supported by additional functionality. See the :ref:`file-handling` section of this page for more information.
pl: W przypadku niektórych plików możliwy jest dostęp do dodatkowych funkcji. Więcej informacji można znaleźć w sekcji :ref:`file-handling`.

source: HTTP Upload
pl: Przesyłanie plików przez HTTP

source: HTTP Upload is a common browser-based file upload tool you may be familiar with from other web applications. You can upload files via HTTP by selecting them from your browser or dragging and dropping them into the upload widget.
pl: Przesyłanie przez HTTP to popularny sposób na załadowanie plików. Wykorzystuje on przeglądarkę internetową i jest stosowany w wielu aplikacjach internetowych. Pliki można przesyłać wybierając je za pomocą przeglądarki lub przeciągając je i upuszczając do komponentu przesyłania.

source: Once you have uploaded files, you will be able to edit file metadata, restrict access to files [#f1]_ , and/or add tags. Click "Save Changes" to complete the upload. If you uploaded a file by mistake, you can delete it before saving by clicking the checkbox to select the file, and then clicking the "Delete" button above the Files Table.
pl: Po przesłaniu plików można edytować metadane plików, ograniczyć do nich dostęp [#f1]_ i/lub dodawać znaczniki. Kliknij "Zapisz zmiany", aby zakończyć przesyłanie. Jeśli przesłałeś plik przez pomyłkę, możesz go usunąć przed zapisaniem. Wybierz plik do usunięcia klikając w pole wyboru, następnie kliknij przycisk "Usuń" widoczny nad tabelą plików.

source: File upload limit size varies based on Dataverse installation. The file upload size limit can be found in the text above the HTTP upload widget. If you need to upload a very large file or a very large *number* of files, consider using rsync + SSH upload if your installation of Dataverse offers it.
pl: Dopuszczalny rozmiar przesyłanych plików różni się w zależności od instalacji oprogramowania Dataverse. Informację o dopuszczalnym rozmiarze pliku można znaleźć nad oknem do przesyłania HTTP. Jeśli chcesz przesłać bardzo duży plik lub bardzo dużą *liczbę* plików, rozważ użycie przesyłania za pomocą rsync + SSH, jeśli instalacja Dataverse oferuje to rozwiązanie.

source: Some Dataverse installations do not allow this feature.
pl: Niektóre instalacje Repozytorium nie dają tej możliwości

source: File Handling
pl: Obsługa plików

source: Certain file types in Dataverse are supported by additional functionality, which can include downloading in different formats, file-level metadata preservation, file-level data citation; and exploration through data visualization and analysis. See the sections below for information about special functionality for specific file types.
pl: Z niektórymi typami plików w repozytorium związane są dodatkowe funkcje takie jak pobieranie w różnych formatach, tworzenie podzbiorów, przechowywanie metadanych na poziomie pliku, cytowanie danych na poziomie pliku, wizualizację i analizę danych. W poniższych sekcjach znajdują się informacje na temat specjalnych funkcji dostępnych dla poszczególnych typów plików.

source: Tabular Data Files
pl: Tabelaryczne pliki danych

source: Files in certain formats - Stata, SPSS, R, Excel(xlsx), CSV, and TSV - may be ingested as tabular data (see :ref:`Tabular Data Ingest <tabular-data-ingest>` for details).
pl: Pliki w niektórych formatach – Stata, SPSS, R, Excel (xlsx), CSV i TSV - mogą być traktowane jako dane tabelaryczne (zob. :ref:`Analiza danych tabelarycznych<tabular-data-ingest>` w podręczniku użytkownika).

source: Additional download options available for tabular data (found in the same drop-down menu under the "Download" button):
pl: Dodatkowo możliwe jest pobranie danych tabelarycznych w następujących postaciach (opcja dostępna w menu rozwijanym znajdującym się pod przyciskiem "Pobierz"):

source: As tab-delimited data (with the variable names in the first row);
pl: Jako dane rozdzielone tabulatorami (TSV) (z nazwami zmiennych w pierwszym wierszu);

source: The original file uploaded by the user;
pl: Jako oryginalny plik przesłany przez użytkownika;

source: Saved as R data (if the original file was not in R format);
pl: Jako dane programu R (rdata), jeżeli oryginalny plik nie był w formacie R;

source: Variable Metadata (as a `DDI Codebook <http://www.ddialliance.org/Specification/DDI-Codebook/>`_ XML file);
pl: Jako metadane zmiennych (jako plik XML wg schematu `DDI Codebook <http://www.ddialliance.org/Specification/DDI-Codebook/>`_);

source: Data File Citation (currently in either RIS, EndNote XML, or BibTeX format);
pl: Jako cytowanie pliku danych (obecnie w formacie RIS, EndNote XML lub BibTeX);

source: All of the above, as a zipped bundle.
pl: Wszystkie powyższe w postaci spakowanej.

source: Astronomy (FITS)
pl: Astronomia (FITS)

source: Metadata found in the header section of `Flexible Image Transport System (FITS) files <http://fits.gsfc.nasa.gov/fits_primer.html>`_ are automatically extracted by Dataverse, aggregated and displayed in the Astronomy Domain-Specific Metadata of the Dataset that the file belongs to. This FITS file metadata, is therefore searchable and browsable (facets) at the Dataset-level.
pl: Metadane znalezione w sekcji nagłówka plików `Flexible Image Transport System (FITS) <http://fits.gsfc.nasa.gov/fits_primer.html>`_ są automatycznie wyodrębniane przez repozytorium, agregowane i wyświetlane jako metadane specyficzne dla zbioru danych astronomicznych, do którego należy dany plik. Metadane tego pliku FITS są przeszukiwalne i dostępne do przeglądania na poziomie zbioru danych.

source: Compressed Files
pl: Pliki skompresowane

source: Compressed files in zip format are unpacked automatically. If it fails to unpack, for whatever reason, it will upload as is. If the number of files inside are more than a set limit (1,000 by default, configurable by the Administrator), you will get an error message and the zip file will uploads as is.
pl: W zależności od konfiguracji, repozytorium może automatycznie dokonywać próby rozpakowania wszystkich przesłanych plików w formacie zip. Jeśli z jakiegokolwiek powodu próba ta nie powiedzie się, plik zostanie przesłany w niezmienionej postaci. Również jeśli liczba plików w środku jest większa niż ustalony limit (domyślnie wynoszący 1000, ale możliwy do skonfigurowania przez administratora), pojawi się komunikat o błędzie, a plik zip zostanie przesłany w niezmienionej postaci.

source: If the uploaded zip file contains sub-folders, the names of the folders will be preserved as the ``DirectoryLabel`` attributes in the ``FileMetadata`` objects of the corresponding individual datafiles. As of writing this - v.4.11 - these labels are only used to restore the folder structure in multi-file, zipped download bundles (see :doc:`/api/dataaccess` for more information).
pl: Jeżeli przesłany plik zip zawiera podfoldery, nazwy folderów zostaną zachowane jako atrybuty DirectoryLabel w metadanych plików odpowiadających poszczególnym plikom danych. Począwszy od wersji 4.11 Dataverse etykiety te są używane tylko do przywracania struktury folderów w wieloplikowych, spakowanych pakietach do pobrania (zob. :doc:`/api/dataaccess` w języku angielskim, aby uzyskać więcej informacji).

source: Other File Types
pl: Inne typy plików

source: There are several advanced options available for certain file types.
pl: Dostępnych jest kilka zaawansowanych opcji dla niektórych typów plików.

source: Image files: .jpg, .png, and .tif files are able to be selected as the default thumbnail for a dataset. The selected thumbnail will appear on the search result card for that dataset.
pl: Pliki obrazów: .jpg, .png i .tif mogą być wybrane jako domyślna miniaturka zbioru danych. Wybrana miniaturka pojawi się na liście wyników wyszukiwania przy odpowiednim zbiorze danych.

source: SPSS files: SPSS files can be tagged with the language they were originally coded in. This is found by clicking on Advanced Options and selecting the language from the list provided.
pl: Pliki SPSS: Pliki SPSS mogą być oznaczane językiem, w którym zostały pierwotnie zakodowane. Opcję tę można znaleźć klikając na "Opcje zaawansowane" i wybierając język z podanej listy.

source: Edit Files
pl: Edycja plików

source: Edit File Metadata
pl: Edycja metadanych pliku

source: Go to the dataset you would like to edit, where you will see the listing of files. Select the files you would like to edit by using either the Select All checkbox or individually selecting files. Next, click the "Edit Files" button above the file table and from the dropdown menu select if you would like to:
pl: Strona zbioru danych, który ma być edytowany zawiera listę plików. Należy wybrać pliki, które chcemy edytować. Można w tym celu skorzystać z opcji "Wybierz wszystkie" lub zaznaczyć poszczególne pliki. Następnie należy kliknąć przycisk "Edytuj pliki" nad tabelą z plikami i z menu rozwijanego wybrać którąś z dostępnych opcji:

source: Delete the selected files,
pl: Usunięcie wybranych plików.

source: Edit the file metadata (file name, description) for the selected files,
pl: Edycja metadanych wybranych plików (np. ich nazwy czy opisu).

source: Edit licenses for the selected files,
pl: Edycja licencji wybranych plików.

source: Add tags to the selected files.
pl: Edycja tagów wybranych plików.

source: You will not have to leave the dataset page to complete these action, except for editing file metadata, which will bring you to the "Edit Files" page. There you will have to click the "Save Changes" button to apply your edits and return to the dataset page.
pl: Nie jest konieczne opuszczanie strony zbioru danych, aby ukończyć te czynności. Wyjątkiem jest edycja metadanych pliku, która przenosi na stronę "Edytuj pliki", na której należy kliknąć "Zapisz zmiany", aby zachować zmiany i powrócić do strony zbioru danych.

source: File Tags
pl: Tagi plików

source: File tags are comprised of custom, category (i.e. Documentation, Data, Code) and tabular data tags (i.e. Event, Genomics, Geospatial, Network, Panel, Survey, Time Series). Use the dropdown select menus as well as the custom file tag input to apply these tags to the selected files. There is also a Delete Tags feature that, if checked, will allow you to delete unused file tags within that dataset.
pl: Tagi plików to znaczniki danych opisujące ich kategorię (np. dokumentacja, dane, kod), charakteryzujące dane tabelaryczne (np. zdarzenia, dane genomiczne, geoprzestrzenne, sieciowe, panelowe, szeregi czasowe). Aby zastosować te tagi do wybranych plików, należy skorzystać z menu wyboru w menu rozwijanym lub wprowadzić tagi niestandardowe. Dostępna jest również funkcja "Usuń tagi", która – jeśli zostanie zaznaczona – pozwoli na usunięcie tagów, które nie są używane w danym zbiorze.

source: Replace Files
pl: Zastępowanie plików

source: In cases where you would like to revise an existing file rather than add a new one, you can do so using our Replace File feature. This will allow you to track the history of this file across versions of your dataset, both before and after replacing it. This could be useful for updating your data or fixing mistakes in your data. Because replacing a file creates an explicit link between the previous dataset version and the current version, the file replace feature is not available for unpublished dataset drafts. Also note that replacing a file will not automatically carry over that file's metadata, but once the file is replaced then its original metadata can still be found by referencing the previous version of the file under the "Versions" tab of the file page.
pl: Gdy zajdzie konieczność zastąpienia pliku, a nie chcemy dodawać nowego, można to zrobić korzystając z funkcji zastąpienia pliku. Zastosowanie tej opcji pozwoli na śledzenie historii tego pliku w różnych wersjach zbioru danych, zarówno przed, jak i po jego zastąpieniu. Może to być pomocne w aktualizacji danych lub w naprawie błędnych danych. Zastąpienie pliku tworzy wyraźne połączenie między poprzednią a obecną wersją zbioru danych. Funkcja ta nie jest dostępna dla niepublikowanych wersji roboczych zbiorów danych. Należy również pamiętać, że zastąpienie pliku nie spowoduje automatycznego przeniesienia metadanych tego pliku, ale po wymianie pliku jego oryginalne metadane można nadal znaleźć, odwołując się do poprzedniej wersji pliku w zakładce "Wersje" na stronie pliku.

source: To replace a file, go to the file page for that file, click on the "Edit" button, and from the dropdown list select "Replace". This will bring you to the Replace File page, where you can see the metadata for the most recently published version of the file and you can upload your replacement file. Once you have uploaded the replacement file, you can edit its name, description, and tags. When you're finished, click the "Save Changes" button.
pl: Aby zastąpić plik, należy na jego stronie kliknąć przycisk "Edytuj", a następnie z listy rozwijanej wybrać opcję "Zastąp". Spowoduje to przejście do strony zastępowania plików, na której można zapoznać się z metadanymi ostatnio opublikowanej wersji pliku i przesłać plik, który ma go zastąpić. Po przesłaniu nowego pliku można edytować jego nazwę, opis i znaczniki. Po zakończeniu procesu zastępowania należy kliknąć "Zapisz zmiany".

source: After successfully replacing a file, a new dataset draft version will be created. A summary of your actions will be recorded in the "Versions" tab on on both the dataset page and file page. The Versions tab allows you to access all previous versions of the file across all previous versions of your dataset, including the old version of the file before you replaced it.
pl: Po pomyślnym zastąpieniu pliku zostanie utworzona nowa wersja robocza zbioru danych. Podsumowanie tych działań zostanie zapisane w zakładce "Wersje" zarówno na stronie zbioru danych, jak i na stronie pliku. Zakładka "Wersje" umożliwia dostęp do wszystkich poprzednich wersji pliku we wszystkich poprzednich wersjach zbioru danych, w tym do starej wersji pliku sprzed jego zastąpienia.

source: Guestbook
pl: Księga gości

source: This is where you will enable a particular Guestbook for your dataset, which is setup at the dataverse-level. For specific instructions please visit the :ref:`Dataset Guestbooks <dataset-guestbooks>` section of the Dataverse Management page.
pl: W tym miejscu można utworzyć księgę gości dla zbioru danych, która będzie ustawiona na poziomie kolekcji. Szczegółowe instrukcje są dostępne w sekcji :ref:`Księgi gości zbioru danych <dataset-guestbooks>` na stronie poświęconej administrowaniu kolekcją.

source: Roles & Permissions
pl: Role i uprawnienia

source: Dataverse user accounts can be granted roles that define which actions they are allowed to take on specific dataverses, datasets, and/or files. Each role comes with a set of permissions, which define the specific actions that users may take.
pl: Do kont użytkowników repozytorium można przypisać role. Rola określa, jakie działania można podejmować w odniesieniu do danej kolekcji, zbioru danych i/lub plików. Do każdej roli przypisany jest zestaw uprawnień, określający jakie działania można podjąć.

source: Roles and permissions may also be granted to groups. Groups can be defined as a collection of Dataverse user accounts, a collection of IP addresses (e.g. all users of a library's computers), or a collection of all users who log in using a particular institutional login (e.g. everyone who logs in with a particular university's account credentials).
pl: Role i uprawnienia mogą być również przyznawane grupom. Grupę może stanowić zbiór kont użytkowników repozytorium, zbiór adresów IP (np. wszystkich użytkowników komputerów w danej bibliotece) lub zbiór wszystkich użytkowników, którzy logują się za pomocą konkretnego loginu instytucjonalnego (np. każdy, kto loguje się za pomocą konta uczelnianego).

source: Dataset-Level
pl: Poziom zbioru danych
