Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/dataverse-management.po
Languages: pl

source: Under the Users/Groups tab, you can add, edit, or remove the roles granted to users and groups on your dataverse. A role is a set of permissions granted to a user or group when they're using your dataverse. For example, giving your research assistant the "Contributor" role would give her the following self-explanatory permissions on your dataverse and all datasets within your dataverse: "ViewUnpublishedDataset", "DownloadFile", "EditDataset", and "DeleteDatasetDraft". She would, however, lack the "PublishDataset" permission, and thus would be unable to publish datasets on your dataverse. If you wanted to give her that permission, you would give her a role with that permission, like the Curator role. Users and groups can hold multiple roles at the same time if needed. Roles can be removed at any time. All roles and their associated permissions are listed under the "Roles" tab of the same page.
pl: W sekcji "Użytkownicy/Grupy" możesz dodawać, edytować lub usuwać role w kolekcji. Rola to zestaw uprawnień w kolekcji nadawanych użytkownikowi lub grupie. Na przykład, rola "Kontrybutor" daje następujące uprawnienia w kolekcji i wszystkich umieszczonych w niej zbiorach danych: ``WyświetlNieopublikowanąKolekcję``, ``PobierzPlik``, ``EdytujZbiórDanych``, oraz ``UsuńWersjęRobocząZbioruDanych``. Nie daje ona jednak uprawnienia ``PublikujZbiórDanych``, a tym samym nie daje możliwości publicznego udostępniania zbiorów danych w kolekcji. Aby dodać to uprawnienie, należy przyznać taką rolę, która je obejmuje, np. rolę kuratora. Użytkownicy i grupy mogą w razie potrzeby pełnić wiele ról jednocześnie. Role można usunąć w każdej chwili. Wszystkie role i związane z nimi uprawnienia są wymienione w zakładce "Role" na tej samej stronie.

source: User/Group suggestion in Assign Role modal
pl: Sugerowanie użytkowników/Grup w oknie modalnym przypisywania ról

source: Screenshot of Assign Role modal window with suggested user for User/Group field.
pl: Zrzut ekranu prezentujący okno modalne przypisywania ról z widoczną sugestią dla pola Użytkownik/Grupa

source: Note that the Dataset Creator role and Contributor role are sometimes confused. The Dataset Creator role is assigned at the dataverse level and allows a user to create new datasets in that dataverse. The Contributor role can be assigned at the dataset level, granting a user the ability to edit *that specific* dataset. Alternatively, the Contributor role can be assigned at the dataverse level, granting the user the ability to edit *all* datasets in that dataverse.
pl: Zauważyć trzeba, że rola twórcy zbioru danych i rola kontrybutora są czasami mylone. Rola twórcy zbioru danych jest przypisana na poziomie kolekcji i pozwala użytkownikowi na tworzenie w niej nowych zbiorów danych. Rola kontrybutora może być przypisana na poziomie zbioru danych, co daje użytkownikowi możliwość edycji *tego konkretnego* zbioru danych. Rola kontrybutora może być ewentualnie przypisana na poziomie kolekcji, co daje użytkownikowi możliwość edycji *wszystkich* umieszczonych w niej zbiorów danych.

source: Assign Role modal
pl: Okno modalne przypisywania ról

source: Screenshot of Assign Role modal window.
pl: Zrzut ekranu prezentujący okno modalne przypisywania ról.

source: If you need to assign a role to ALL Dataverse user accounts, you can assign the role to the ``:authenticated-users`` group.
pl: Aby przypisać określoną rolę do WSZYSTKICH kont użytkowników w danej instalacji repozytorium, należy przypisać ją do grupy o nazwie ``:authenticated-users``.

source: Dataset Templates
pl: Szablony zbiorów danych

source: Templates are useful when you have several datasets that have the same information in multiple metadata fields that you would prefer not to have to keep manually typing in, or if you want to use a custom set of Terms of Use and Access for multiple datasets in a dataverse. In Dataverse 4.0, templates are created at the dataverse level, can be deleted (so it does not show for future datasets), set to default (not required), or can be copied so you do not have to start over when creating a new template with similar metadata from another template. When a template is deleted, it does not impact the datasets that have used the template already.
pl: Szablony są przydatne, gdy kilka zbiorów danych w wielu polach metadanych zawiera te same informacje. Dzięki szablonom nie trzeba wielokrotnie wpisywać ich ręcznie. Są one tworzone na poziomie kolekcji. Szablon można ustawić jako domyślny (nie jest jednak obowiązkowy). Szablon można skopiować, jeśli chce się utworzyć nowy szablon z podobnymi metadanymi. Można go też usunąć – wtedy nie jest on widoczny przy tworzeniu nowych zbiorów danych. Gdy szablon jest usuwany, nie ma to wpływu na już istniejące zbiory danych, w których został użyty.

source: How do you create a template?
pl: jak utworzyć szablon?

source: Navigate to your dataverse, click on the Edit Dataverse button and select Dataset Templates.
pl: W tym celu należy przejść na stronę kolekcji, kliknąć przycisk "Edytuj" i wybrać opcję "Szablony zbioru danych".

source: Once you have clicked on Dataset Templates, you will be brought to the Dataset Templates page. On this page, you can 1) decide to use the dataset templates from your parent dataverse 2) create a new dataset template or 3) do both.
pl: Nastąpi przejście na stronę "Zarządzaj szablonami zbiorów danych". Na tej stronie można 1) określić, czy zostaną wykorzystane szablony z kolekcji nadrzędnej, 2) utworzyć nowy szablon zbioru danych lub 3) skorzystać z obu tych możliwości.

source: Click on the Create Dataset Template to get started. You will see that the template is the same as the create dataset page with an additional field at the top of the page to add a name for the template.
pl: Kliknięcie opcji "Utwórz szablon zbioru danych" rozpocznie proces tworzenia nowego szablonu. Strona tworzenia szablonu przypomina nieco stronę tworzenia zbioru danych z dodatkowym polem pozwalającym określić nazwę szablonu, które znajduje się u góry strony.

source: After clicking Save Dataset Template, you will be brought back to the Manage Dataset Templates page and should see your template listed there now with the make default, edit, view, or delete options.
pl: Po kliknięciu przycisku "Zapisz" nastąpi przejście z powrotem na stronę "Zarządzaj szablonami zbiorów danych". Szablon powinien być teraz widoczny i posiadać opcje "Ustaw jako domyślny", "Edytuj", "Wyświetl" i "Usuń".

source: A dataverse does not have to have a default template and users can select which template they would like to use while on the Add New Dataset page.
pl: Kolekcja nie musi mieć domyślnego szablonu. Użytkownicy mogą też wybrać, którego szablonu chcą użyć na stronie "Dodaj nowy zbiór danych".

source: You can also click on the View button on the Manage Dataset Templates page to see what metadata fields have information filled in.
pl: Aby sprawdzić, które pola metadanych mają wypełnione informacje, należy kliknąć przycisk "Wyświetl" na stronie "Zarządzaj szablonami zbiorów danych".

source: \* Please note that the ability to choose which metadata fields are hidden, required, or optional is done on the General Information page for the dataverse.
pl: \* Należy pamiętać, że podziału pól metadanych na ukryte, wymagane i opcjonalne można dokonać na stronie "Informacje ogólne" kolekcji.

source: Dataset Guestbooks
pl: Księgi gości zbioru danych

source: Guestbooks allow you to collect data about who is downloading the files from your datasets. You can decide to collect account information (username, given name & last name, affiliation, etc.) as well as create custom questions. You are also able to download the data collected from the enabled guestbooks as Excel files to store and use outside of Dataverse.
pl: Księgi gości pozwalają na gromadzenie danych o tym, kto pobiera pliki ze zbiorów danych. Można zbierać informacje o koncie (nazwa użytkownika, imię i nazwisko, afiliacja, itp.), jak również tworzyć niestandardowe pytania własne. Możesz również pobrać dane zebrane z aktywnych ksiąg gości w formacie plików Excela.

source: How do you create a guestbook?
pl: Jak stworzyć księgę gości?

source: After creating a dataverse, click on the Edit Dataverse button and select Dataset Guestbook
pl: Po utworzeniu kolekcji kliknij na przycisk "Edytuj kolekcję" i wybierz "Księgi gości zbioru danych".

source: By default, guestbooks created in the dataverse your dataverse is in, will appear. If you do not want to use or see those guestbooks, uncheck the checkbox that says Include Guestbooks from Root Dataverse.
pl: Domyślnie księgi gości utworzone w kolekcji nadrzędnej pojawią się w Twojej kolekcji. Jeśli nie chcesz korzystać z tych ksiąg gości, usuń zaznaczenie pola "Uwzględnij księgi gości z [nazwa kolekcji nadrzędnej]"

source: To create a new guestbook, click the Create Dataset Guestbook button on the right side of the page.
pl: Aby utworzyć nową księgę gości, kliknij przycisk "Utwórz księgę gości zbioru danych" znajdujący się po prawej stronie.

source: Name the guestbook, determine the account information that you would like to be required (all account information fields show when someone downloads a file), and then add Custom Questions (can be required or not required).
pl: Nadaj nazwę księdze gości, wybierz informacje, które mają być gromadzone (wszystkie informacje o koncie użytkownika są zbierane, kiedy ktoś pobiera plik), a następnie dodaj pytania własne (odpowiedź na nie może być wymagana lub niewymagana).

source: Hit the Create Dataset Guestbook button once you have finished.
pl: Po zakończeniu kliknij przycisk "Utwórz księgę gości zbioru danych".

source: What can you do with a guestbook? After creating a guestbook, you will notice there are several options for a guestbook and appear in the list of guestbooks.
pl: Zauważ, że po jej utworzeniu, dla twojej księgi gości dostępnych jest kilka opcji

source: If you want to use a guestbook you have created, you will first need to click the button in the Action column that says Enable. Once a guestbook has been enabled, you can go to the License + Terms for a dataset and select a guestbook for it.
pl: Jeśli chcesz korzystać z utworzonej przez siebie księgi gości, musisz najpierw kliknąć przycisk "Włącz" w kolumnie "Akcje". Gdy księga gości zostanie włączona, możesz przejść do edycji zbioru danych i przypisać księgę gości do zbioru danych.

source: There are also options to view, copy, edit, or delete a guestbook.
pl: Dostępne są również opcje przeglądania, kopiowania, edytowania i usuwania księgi gości.

source: Once someone has downloaded a file in a dataset where a guestbook has been assigned, an option to download collected data will appear.
pl: Po pobraniu przez kogoś pliku ze zbioru danych, do którego przypisano księgę gości, pojawi się opcja pobrania zgromadzonych danych.

source: Featured Dataverses
pl: Wyróżnione kolekcje

source: Featured Dataverses is a way to display sub dataverses in your dataverse that you want to feature for people to easily see when they visit your dataverse.
pl: Wyróżnienie kolekcji to sposób jej prezentację w sposób zwracający uwagę użytkowników.

source: Click on Featured Dataverses and a pop up will appear. Select which sub dataverses you would like to have appear.
pl: Kliknij na "Wyróżnione kolekcje". Pojawi się okno dialogowe. Wybierz kolekcje podrzędne, które chcesz wyróżnić.

source: Featured Dataverses can only be used with published dataverses.
pl: Można wyróżnić jedynie te kolekcje podrzędne, które zostały opublikowane.

source: Dataset Linking
pl: Przypięcie zbioru danych

source: Dataset linking allows a dataverse owner to "link" their dataverse to a dataset that exists outside of that dataverse, so it appears in the dataverse’s list of contents without actually *being* in that dataverse. You can link other users' datasets to your dataverse, but that does not transfer editing or other special permissions to you. The linked dataset will still be under the original user's control.
pl: Przypięcie zbioru danych pozwala właścicielowi kolekcji na powiązanie swojej kolekcji ze zbiorem danych znajdującym się poza tą kolekcją. Przypięty zbiór pojawi się na liście zawartości tej kolekcji, choć w rzeczywistości się w niej *nie znajduje*. Można przypiąć do swojej kolekcji zbiory danych innych użytkowników, ale nie zmieni to uprawnień do dokonywania edycji lub innych działań. Przypięty zbiór danych pozostanie pod kontrolą pierwotnego użytkownika.

source: For example, researchers working on a collaborative study across institutions can each link their own individual institutional dataverses to the one collaborative dataset, making it easier for interested parties from each institution to find the study.
pl: Na przykład, współpracujący ze sobą badacze z różnych instytucji mogą przypiąć swoje wspólne zbiory danych do swoich osobistych kolekcji. Ułatwi to znalezienie danych zainteresowanym osobom z obu instytucji.

source: In order to link a dataset, you will need your account to have the "Add Dataset" permission on the Dataverse that is doing the linking. If you created the dataverse then you should have this permission already, but if not then you will need to ask the admin of that dataverse to assign that permission to your account. You do not need any special permissions on the dataset being linked.
pl: Aby przypiąć zbiór danych, nie trzeba posiadać do niego żadnych szczególnych uprawnień. W kolekcji, do której chcesz przypiąć zbiór danych, musisz dysponować uprawnieniem ``DodajZbiórDanych``. Jeśli jesteś twórcą kolekcji, powinieneś mieć już to uprawnienie. Jeśli nie, poproś administratora kolekcji o przypisanie go do Twojego konta.

source: To link a dataset to your dataverse, you must navigate to that dataset and click the "Link" button in the upper-right corner of the dataset page. This will open up a window where you can type in the name of the dataverse that you would like to link the dataset to. Select your dataverse and click the save button. This will establish the link, and the dataset will now appear under your dataverse.
pl: Aby przypiąć zbiór danych do kolekcji, musisz przejść do strony tego zbioru danych i kliknąć przycisk "Przypnij" w prawym górnym rogu. Otworzy się okno, w którym można wpisać nazwę kolekcji, do której chcesz przypiąć zbiór danych. Wybierz właściwą kolekcję i kliknij przycisk "Zapisz". Zbiór zostanie powiązany i pojawi się w odpowiedniej kolekcji.

source: There is currently no way to remove established links in the UI. If you need to remove a link between a dataverse and a dataset, please contact the support team for the Dataverse installation you are using.
pl: Obecnie w interfejsie użytkownika nie ma możliwości usunięcia utworzonych powiązań. W przypadku konieczności usunięcia powiązania między kolekcją a zbiorem danych należy skontaktować się z pomocą techniczną repozytorium.

source: Dataverse Linking
pl: Przypinanie kolekcji

source: Similarly to dataset linking, dataverse linking allows a dataverse owner to "link" their dataverse to another dataverse, so the dataverse being linked will appear in the linking dataverse's list of contents without actually *being* in that dataverse. Currently, the ability to link a dataverse to another dataverse is a superuser only feature.
pl: Podobnie, jak to ma miejsce w przypadku przypinania zbioru danych, Repozytorium pozwala właścicielom kolekcji na ich powiązanie. Kolekcja pojawi się na liście zawartości innej kolekcji, do której jest przypięta, choć w rzeczywistości nie będzie włączona w jej obręb. Obecnie funkcja przypinania kolekcji jest dostępna jedynie dla superużytkowników.

source: If you need to have a dataverse linked to your dataverse, please contact the support team for the Dataverse installation you are using.
pl: Aby przypiąć jakąś jakaś kolekcja została przypięta do innej kolekcji, należy skontaktować się z pomocą techniczną repozytorium.

source: Publish Your Dataverse
pl: Opublikowanie kolekcji

source: Once your dataverse is ready to go public, go to your dataverse page, click on the "Publish" button on the right hand side of the page. A pop-up will appear to confirm that you are ready to actually Publish, since once a dataverse is made public, it can no longer be unpublished.
pl: Gdy kolekcja będzie już gotowa do opublikowania, należy przejść na jej stronę i kliknąć widoczny po prawej stronie przycisk "Opublikuj". Operacji opublikowania kolekcji nie można cofnąć, więc trzeba ją potwierdzić raz jeszcze w oddzielnym okienku.
