Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/dataset-management.po
Languages: pl

source: Creating a Private URL for your dataset allows you to share your dataset (for viewing and downloading of files) before it is published to a wide group of individuals who may not have a user account on Dataverse. Anyone you send the Private URL to will not have to log into Dataverse to view the dataset.
pl: Utworzenie prywatnego adresu URL dla zbioru danych umożliwia jego udostępnienie wybranej grupie osób (np. recenzentom artykułu naukowego) jeszcze przed jego oficjalnym opublikowaniem. Osoby te nie muszą posiadać konta użytkownika w repozytorium. Prywatny adres URL umożliwia przeglądanie zbioru i pobieranie plików. Każdy, kto otrzyma taki adres URL będzie mógł zobaczyć ten zbiór danych bez konieczności logowania się do repozytorium.

source: Go to your unpublished dataset
pl: Przejdź do wersji roboczej zbioru danych.

source: Select the “Edit” button
pl: Wybierz przycisk "Edytuj".

source: Select “Private URL” in the dropdown menu
pl: W menu rozwijanym wybierz opcję "Prywatny adres URL".

source: In the pop-up select “Create Private URL”
pl: W oknie dialogowym wybierz "Utwórz prywatny URL".

source: Copy the Private URL which has been created for this dataset and it can now be shared with anyone you wish to have access to view or download files in your unpublished dataset.
pl: Utworzony URL możesz skopiować i wysyłać do odpowiednich osób.

source: To disable a Private URL and to revoke access, follow the same steps as above until step #3 when you return to the popup, click the “Disable Private URL” button.
pl: Aby wyłączyć prywatny adres URL i odebrać dostęp do wersji roboczej zbioru danych, należy powtórzyć opisane wyżej czynności, w punkcie 3 klikając tym razem "Dezaktywuj prywatny URL".

source: Private URL also allows accessing a dataset that is under embargo.
pl: Prywatny adres URL umożliwia również dostęp do zbioru danych objętego embargiem.

source: Dataset Versions
pl: Wersje zbioru danych

source: Versioning is important for long-term research data management where metadata and/or files are updated over time. It is used to track any metadata or file changes (e.g., by uploading a new file, changing file metadata, adding or editing metadata) once you have published your dataset.
pl: Z punktu widzenia długoterminowego zarządzania danymi badawczymi kluczowe jest przechowywanie wszystkich wersji zbioru, zwłaszcza że metadane i//lub pliki każdego zbioru danych mogą być z czasem aktualizowane. Przechowywanie wersji umożliwia śledzenie wszelkich zmian w metadanych lub plikach (np. tych polegających na przesłaniu nowego pliku, zmianie metadanych pliku, dodaniu lub edycji metadanych zbioru) dokonanych już po opublikowaniu zbioru danych.

source: Dataset versioning
pl: Wersjonowanie zbiorów danych

source: Schematic diagram presenting rules of Dataset versioning
pl: Schematyczne przedstawienie zasad wersjonowania zbiorów danych

source: Once you edit your published dataset a new draft version of this dataset will be created. To publish this new version of your dataset, select the "Publish Dataset" button on the top right side of the page. If you were at version 1 of your dataset, depending on the types of changes you had made, you would be asked to publish your draft as either version 1.1 or version 2.0.
pl: Po każdej edycji dokonanej w opublikowanym już zbiorze danych zostanie utworzona nowa wersja robocza tego zbioru. Aby opublikować tę nową wersję należy kliknąć przycisk "Opublikuj" w prawym górnym rogu strony. Jeśli wcześniej opublikowano już pierwszą wersję zbioru w zależności od rodzaju dokonanych zmian system poprosi o opublikowanie zmodyfikowanego zbioru jako wersji 1.1 lub wersji 2.0 (lub – odpowiednio – kolejnych).

source: **Important:** If you add a file, your dataset will automatically be bumped up to a major version (e.g., if you were at 1.0 you will go to 2.0).
pl: **Ważna uwaga:** Jeśli zostanie dodany plik, zbiór danych będzie automatycznie opublikowany jako pełna nowa wersja zbioru (np. jeśli zbiór był oznaczony jako wersja 1.0, nowa wersja zostanie opublikowana jako 2.0, a nie 1.1.).

source: On the Versions tab of a dataset page, there is a versions table that displays the version history of the dataset. You can use the version number links in this table to navigate between the different versions of the dataset, including the unpublished draft version, if you have permission to access it.
pl: W zakładce "Wersje" na stronie zbioru danych znajduje się tabela wersji, która wyświetla historię zmian w zbiorze danych. Za pomocą linków z numerami wersji można nawigować pomiędzy różnymi wersjami zbioru danych, w tym także niepublikowaną wersją roboczą (dostęp do tej wersji mają tylko uprawnieni użytkownicy).

source: There is also a Versions tab on the file page. The versions table for a file displays the same information as the dataset, but the summaries are filtered down to only show the actions related to that file. If a new dataset version were created without any changes to an individual file, that file's version summary for that dataset version would read "No changes associated with this version".
pl: Zakładka "Wersje" jest również dostępna na stronie pliku. Tabela wersji pliku powiela informacje z poziomu zbioru danych, są one jednak przefiltrowane w taki sposób, by pokazać tylko zmiany związane z danym plikiem. Jeśli zostanie utworzona nowa wersja zbioru danych, ale zmiany nie będą dotyczyły tego pliku, w tabeli pojawi się informacja o braku w tej wersji.

source: Version Details
pl: Szczegóły dotyczące wersji

source: To view exactly what has changed, starting from the originally published version to any subsequent published versions: click the Versions tab on the dataset page to see all versions and changes made for that particular dataset.
pl: Aby zobaczyć, co dokładnie zostało zmienione począwszy od pierwszej opublikowanej wersji przez kolejne wersje, należy kliknąć zakładkę "Wersje" na stronie zbioru danych. Zostaną wtedy wyświetlone wszystkie wersje i zmiany wprowadzone do tego zbioru danych.

source: Once you have more than one version (this can simply be version 1 and a draft), you can click the "View Details" link next to each summary to learn more about the metadata fields and files that were either added or edited. You can also click the checkboxes to select any two dataset versions, then click the "View Differences" button to open the Version Differences Details popup and compare the differences between them.
pl: Jeśli dostępna jest więcej niż jedna wersja zbioru danych (np. pierwsza wersja i wersja robocza), wystarczy kliknąć link "Wyświetl szczegóły", aby uzyskać informacje o polach metadanych i plikach, które zostały dodane lub które były edytowane. Można też wybrać dowolne dwie wersje zbioru danych, a następnie kliknąć przycisk "Wyświetl różnice", aby otworzyć wyskakujące okienko "Szczegółowe różnice między wersjami" umożliwiające porównanie różnic między nimi.

source: Dataset Deaccession
pl: Wycofanie zbioru danych

source: It is not recommended that you deaccession a dataset or a version of a dataset. This is a very serious action that should only occur if there is a legal or valid reason for the dataset to no longer be accessible to the public. If you absolutely must deaccession, you can deaccession a version of a dataset or an entire dataset.
pl: Nie zaleca się wycofywania zbioru danych ani jego wersji. Jest to bardzo poważne działanie, które powinno mieć miejsce tylko wtedy, gdy zaistnieją powody natury prawnej lub inne uzasadnione okoliczności uniemożliwiające publiczne udostępnianie zbioru danych. Jeśli wycofanie zbioru jest absolutnie konieczne, można ten proces przeprowadzić dla konkretnej wersji lub dla całego zbioru danych.

source: To deaccession, go to your published dataset (or add a new one and publish it), click the "Edit" button, and from the dropdown menu select "Deaccession Dataset". If you have multiple versions of a dataset, you can select here which versions you want to deaccession or choose to deaccession the entire dataset.
pl: Aby przeprowadzić operację wycofania, należy przejść do już opublikowanego zbioru danych, kliknąć przycisk "Edytuj", a następnie z menu rozwijanego wybrać opcję "Wycofaj zbiór danych". Jeśli istnieje kilka wersji zbioru danych, można wycofać wybrane wersje lub cały zbiór danych.

source: You must also include a reason as to why this dataset was deaccessioned. Select the most appropriate reason from the dropdown list of options. If you select "Other", you must also provide additional information.
pl: Dokonując wycofania zbioru danych należy także wskazać jego powód. Możliwe powody są dostępne na rozwijanej liście, z której należy wybrać tę pasującą najlepiej. Jeżeli zostanie wybrana opcja "Inne", należy również podać dodatkowe wyjaśnienia.

source: Add more information as to why this was deaccessioned in the free-text box. If the dataset has moved to a different repository or site you are encouraged to include a URL (preferably persistent) for users to continue to be able to access this dataset in the future.
pl: W polu tekstowym należy dodać szersze uzasadnienie przyczyn wycofania. Jeśli zbiór danych został przeniesiony do innego repozytorium lub na inną stronę, należy w tym miejscu podać nowy, trwały adres URL, tak by użytkownicy nadal mieli do niego dostęp.

source: If you deaccession the most recently published version of the dataset but not all versions of the dataset, you may then revisit an earlier version and create a new non-deaccessioned draft for the dataset. For example, imagine you have a version 1 and version 2 of a dataset, both published, and you deaccession version 2. You may then edit version 1 of the dataset and a new draft version will be created.
pl: Jeśli wycofana została tylko ostatnia opublikowana wersja zbioru danych, a wcześniejsze wersje pozostają dostępne, można wejść do wcześniejszej wersji i utworzyć nową wersję roboczą zbioru danych. Np. mając opublikowaną wersję nr 1 i wersję nr 2 zbioru danych, po wycofaniu wersji nr 2 można ponownie edytować wersję nr 1 zbioru danych, na bazie której zostanie utworzona nowa wersja robocza.

source: **Important**: A tombstone landing page with the basic citation metadata will always be accessible to the public if they use the persistent URL (Handle or DOI) provided in the citation for that dataset. Users will not be able to see any of the files or additional metadata that were previously available prior to deaccession.
pl: **Ważna uwaga:** Nawet po wycofaniu zbioru danych publicznie dostępna pozostanie strona z jego podstawowymi metadanymi (tzw. *tombstone*, "nagrobek"), do której prowadzić będzie link utworzony na bazie trwałego identyfikatora (Handle lub DOI) znajdujący się sugerowanym cytowaniu tego zbioru. Pliki czy pozostałe metadane, które zostały wycofane, nie będą w żaden sposób widoczne dla użytkowników.
