Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/dataset-management.po
Languages: pl

source: Admins or curators of a dataset can assign roles and permissions to the users of that dataset. If you are an admin or curator of a dataset, then you can get to the dataset permissions page by clicking the "Edit" button, highlighting "Permissions" from the dropdown list, and clicking "Dataset".
pl: Administratorzy lub kuratorzy zbioru danych mogą przypisywać role i uprawnienia użytkownikom danego zbioru danych. W tym celu należy przejść do strony uprawnień zbioru danych klikając przycisk "Edytuj", z listy rozwijanej wybierając opcję "Uprawnienia" , a następnie opcję "Zbiór danych".

source: When you access a dataset's permissions page, you will see two sections:
pl: Na stronie uprawnień zbioru danych widoczne są dwie sekcje:

source: **Users/Groups:** Here you can assign roles to specific users or groups, determining which actions they are permitted to take on your dataset. You can also reference a list of all users who have roles assigned to them for your dataset and remove their roles if you please. Some of the users listed may have roles assigned at the dataverse level, in which case those roles can only be removed from the dataverse permissions page.
pl: **Użytkownicy/grupy:** w tym miejscu można przypisać role konkretnym użytkownikom lub grupom, określając jakie działania mogą podejmować w danym zbiorze. Można także przejrzeć listę wszystkich użytkowników z wyszczególnionymi rolami jakie zostały im przypisane w tym zbiorze danych. W tym samym widoku można też usunąć te uprawnienia. Niektórzy z użytkowników widocznych na liście mogą mieć role przypisane na poziomie kolekcji. W takim przypadku role te mogą być usunięte tylko na stronie uprawnień kolekcji.

source: **Roles:** Here you can reference a full list of roles that can be assigned to users of your dataset. Each role lists the permissions that it offers.
pl: **Role:** W tym miejscu można przejrzeć pełną listę ról możliwych do przypisania użytkownikom zbioru danych. Każda rola zawiera listę powiązanych z nią uprawnień.

source: File-Level
pl: Poziom pliku

source: If specific files in your dataset are restricted access, then you can grant specific users or groups access to those files while still keeping them restricted to the general public. If you are an admin or curator of a dataset, then you can get to the file-level permissions page by clicking the "Edit" button, highlighting "Permissions" from the dropdown list, and clicking "File".
pl: Dostęp do określonych plików w zbiorze danych może być ograniczony, czyli przyznany tylko uprawnionym, konkretnym użytkownikom lub grupie osób, którzy otrzymają prawa dostępu. Administrator lub kurator zbioru danych może przypisać odpowiednie uprawnienia przechodząc na stronę uprawnień do plików i klikając "Edytuj", wybierając "Uprawnienia" z listy rozwijanej, a następnie wybierając opcję "Plik".

source: When you access a dataset's file-level permissions page, you will see two sections:
pl: Strona uprawnień na poziomie plików zbioru danych ma dwie sekcje:

source: **Users/Groups:** Here you can see which users or groups have been granted access to which files. You can click the "Grant Access to Users/Groups" button to see a box where you can grant access to specific files within your dataset to specific users or groups. If any users have requested access to a file in your dataset, you can grant or reject their access request here.
pl: **Użytkownicy/grupy:** sekcja ta pokazuje, którzy użytkownicy lub grupy otrzymali już dostęp do określonych plików. Po kliknięciu "Przyznaj dostęp użytkownikom/grupom", otworzy się okno, w którym można przyznać dostęp do określonych plików w zbiorze danych określonym użytkownikom lub grupom. Jeśli użytkownik poprosił o dostęp do pliku w zbiorze danych, można w tym miejscu wyrazić na to zgodę lub odrzucić prośbę o dostęp.

source: **Restricted Files:** In this section, you can see the same information, but broken down by each individual file in your dataset. For each file, you can click the "Assign Access" button to see a box where you can grant access to that file to specific users or groups.
pl: **Pliki zastrzeżone:** W tej sekcji informacje o dostępie są rozbite na poszczególne pliki zbioru danych. W odniesieniu do każdego pliku można kliknąć przycisk "Przydziel dostęp", aby wyświetlić okno, w którym można przyznać dostęp do tego pliku określonym użytkownikom lub grupom.

source: Data Provenance
pl: Proweniencja danych

source: Data Provenance is a record of where your data came from and how it reached its current form. It describes the origin of a data file, any transformations that have been made to that file, and any persons or organizations associated with that file. A data file's provenance can aid in reproducibility and compliance with legal regulations. Dataverse can help you keep track of your data's provenance. Currently, Dataverse only makes provenance information available to those who have edit permissions on your dataset.
pl: Proweniencja danych dotyczy tego, skąd pochodzą Twoje dane i w jaki sposób osiągnęły aktualną postać. Jest to informacja o pochodzeniu pliku danych, wszelkich przekształceniach dokonanych w tym pliku oraz osobach lub organizacjach powiązanych z tym plikiem. Proweniencja pliku danych może pomóc w odtworzeniu i sprawdzeniu zgodności z przepisami prawa. Repozytorium pomaga śledzić pochodzenie danych. Obecnie repozytorium udostępnia informacje o proweniencji tylko użytkownikom uprawnionym do edytowania danego zbioru danych.

source: Dataverse accepts provenance information in two forms: a *Provenance File* or a free-text *Provenance Description*. You can attach this provenance information to your data files in Dataverse as part of the file upload process, by clicking Edit -> Provenance (see: :numref:`file-upload-prov-button`).
pl: Repozytorium przyjmuje informacje o proweniencji danych w dwóch postaciach: jako Plik proweniencji lub tekstowy opis pochodzenia. Informacje o proweniencji danych można dołączyć do plików danych w repozytorium w trakcie przesyłania plików, klikając Edycja -> Proweniencja (zob. :numref:`file-upload-prov-button`):

source: Edit provenance screenshot
pl: Zrzut ekranu przedstawiający edycję proweniencji

source: Screenshot of file edit with highlighted entry point for provenance edit
pl: Zrzut ekranu edycji pliku z podświetlonym punktem wprowadzania dla edycji proweniencji

source: This will open a window where you can add your Provenance File and/or Provenance Description (see: :numref:`file-upload-prov-window`).
pl: Otworzy się okno, w którym można dodać plik z danymi dotyczącymi proweniencji i/lub opis proweniencji (zob. :numref:`file-upload-prov-window`):

source: Edit provenance modal window
pl: Okno modalne edycji proweniencji

source: Screenshot of provenance editing modal window
pl: Zrzut ekranu przedstawiający okno modalne edycji proweniencji

source: A **Provenance File** is the preferred way of submitting provenance information to Dataverse because it provides a detailed and trustworthy record. Provenance files are typically generated during the process of data analysis, using provenance capture tools like provR, RDataTracker, NoWorkFlow, recordr, or CamFlow.
pl: **Plik proweniencji** jest preferowanym sposobem przekazywania do Repozytorium informacji o proweniencji danych, jako że zapewnia jej szczegółowy i wiarygodny opis. Pliki proweniencji są zazwyczaj generowane w trakcie procesu analizy danych, przy użyciu narzędzi do rejestrowania proweniencji takich jak provR, RDataTracker, NoWorkFlow, Recordr lub CamFlow.

source: Once you upload a provenance file, Dataverse will need some additional information in order to accurately connect it to your data file. Once provenance file upload finishes, an input box labeled "Connect entity" will appear under the file. Provenance files contain a list of "entities", which include your data file as well as any objects associated with it (e.g. a chart, a spellchecker, etc.). You will need to tell Dataverse which entity within the provenance file represents your data file. You may type the name of the entity into the box, or click the arrow next to the box and select the entity from a list of all entities in the provenance file.
pl: Po przesłaniu pliku proweniencji, repozytorium będzie potrzebowało dodatkowych informacji, aby połączyć go z właściwym plikiem danych. Po przesłaniu pliku proweniencji pojawi się pod nim okienko z napisem "połączone jednostki". Pliki proweniencji zawierają listę "jednostek", która obejmuje plik danych, a także wszelkie powiązane z nim obiekty (np. wykres, moduł sprawdzania pisowni itp.). Należy wskazać, która jednostka w pliku proweniencji reprezentuje plik danych. Można to zrobić wpisując nazwę jednostki w wskazanym miejscu lub klikając strzałkę i wybierając właściwą jednostkę z listy w pliku proweniencji.

source: For more information on entities and the contents of provenance files, see `the W3C PROV Model Primer <https://www.w3.org/TR/prov-primer/#intuitive-overview-of-prov>`_.
pl: Więcej informacji na temat jednostek i zawartości plików pochodzenia znajduje się w `Elementarzu Modelu W3C PROV <https://www.w3.org/TR/prov-primer/#intuitive-overview-of-prov>`_.

source: Once you've uploaded your Provenance File and connected the proper entity, you can hit the Preview button to view the raw JSON of the Provenance File. This can help you confirm that you've uploaded the right file. Be sure to double-check it, because the Provenance File will be made *permanent* once it's finalized. At that point you will not be able to *replace*, *remove*, or otherwise *edit* the Provenance File. This ensures that the Provenance File maintains a stable, immutable record of the data file's history. This finalization of the Provenance File happens at different points depending on the status of your data file. If this is a brand new data file that has never been published before, then its associated Provenance File will be made permanent once you publish the dataset. If this data file *has* been published in a previous version of your dataset, then its associated Provenance File will be made permanent as soon as you upload the Provenance File and click "Save Changes" on the warning popup.
pl: Po przesłaniu pliku proweniencji i podłączeniu odpowiedniej jednostki, po naciśnięciu przycisku "Podgląd" wyświetlony zostanie surowy plik w formacie JSON utworzony na podstawie pliku proweniencji. W ten sposób można upewnić się, czy przesłany został właściwy plik. Zalecane jest dokładne sprawdzenie, ponieważ plik proweniencji będzie zapisany na trwałe po zakończeniu tego działania: nie będzie go można już zastąpić, usunąć ani w inny sposób edytować. Plik proweniencji ma zapewnić stały, niezmienny zapis historii pliku danych. Trwałe zapisanie pliku proweniencji odbywa się w różnych punktach w zależności od statusu pliku danych. Jeśli jest to zupełnie nowy, nie opublikowany wcześniej plik danych, to powiązany z nim plik proweniencji zostanie trwale zapisany dopiero po opublikowaniu zbioru danych. Jeśli ten plik danych był już opublikowany w poprzedniej wersji zbioru danych, to powiązany z nim plik proweniencji zostanie trwale zapisany zaraz po przesłaniu i kliknięciu "Zapisz zmiany".

source: A **Provenance Description** allows you to add more provenance information in addition to or in place of a provenance file. This is a free-text field that allows you to enter any information you feel might be relevant to those interested in learning about the provenance of your data. This might be a good place to describe provenance factors like what operating system you used when working with the data file, what functions or libraries you used, how data was merged into the file, what version of the file you used, etc. The Provenance Description is not as useful or trustworthy as a provenance file, but it can still provide value. Unlike the Provenance File, the Provenance Description is never made permanent: you can always edit, remove, or replace it at any time.
pl: **Opis proweniencji** pozwala dodać informacje uzupełniające dane zawarte w pliku proweniencji lub rekompensujące jego brak. Jest to pole tekstowe, które pozwala na wprowadzenie wszelkich informacji, które mogą być ważne dla osób zainteresowanych proweniencją danych. Można w tym miejscu opisać czynniki, które mogły mieć istotny wpływ na dane, np. jaki system operacyjny był używany podczas pracy z plikiem danych, inne funkcje czy biblioteki z których korzystano, w jaki sposób dane zostały połączone w pliku, jakiej wersji pliku używano itp. Opis proweniencji nie jest tak przydatny i godny zaufania jak plik proweniencji, ale niesie dodatkową wartość informacyjną. W odróżnieniu od pliku proweniencji, opis proweniencji nie jest trwale zapisywany i w każdej chwili może być edytowany, usunięty lub wymieniony.

source: You can return to attach provenance to your data file later on by clicking the "Add + Edit Metadata" button on the file page, and then clicking the "Edit -> Provenance" button.
pl: Plik proweniencji może być później dołączony do pliku danych. W tym celu należy kliknąć "Dodaj + Edytuj metadane" na stronie pliku, a następnie kliknąć "Edytuj" i wybrać opcję "Proweniencja".

source: Thumbnails + Widgets
pl: Miniaturki i Widżety

source: Thumbnails
pl: Miniaturki

source: Thumbnail images can be assigned to a dataset manually or automatically. The thumbnail for a dataset appears on the search result card for that dataset and on the dataset page itself. If a dataset contains one or more data files that Dataverse recognizes as an image, then one of those images is automatically selected as the dataset thumbnail.
pl: Miniaturki obrazów można przypisywać do zbioru danych ręcznie lub automatycznie. Miniaturka przy zbiorze danych pojawi się zarówno na liście wyników wyszukiwania, jak i na stronie zbioru danych. Jeśli zbiór danych zawiera jeden lub więcej plików, które repozytorium rozpoznaje jako obraz, wówczas jeden z tych obrazów jest automatycznie wybierany jako miniaturka tego zbioru danych.

source: If you would like to manually select your dataset's thumbnail, you can do so by clicking the "Edit" button on your dataset, and selecting "Thumbnails + Widgets" from the dropdown menu.
pl: Jeśli chcemy ręcznie wybrać miniaturkę dla danego zbioru, należy kliknąć przycisk "Edytuj" na stronie zbioru danych i z rozwijanego menu wybrać opcję "Miniatury + Widżety".

source: On this page, under the Thumbnail tab you will see three possible actions.
pl: Na tej stronie, w zakładce "Miniaturka", dostępne są trzy opcje:

source: **Select Available File:** Click the "Select Thumbnail" button to choose an image from your dataset to use as the dataset thumbnail.
pl: **Wybierz dostępny plik:** Należy kliknąć przycisk "Wybierz miniaturkę", aby wybrać plik graficzny który ma być użyty jako miniaturka zestawu danych.

source: **Upload New File:** Upload an image file from your computer to use as the dataset thumbnail. While by default your thumbnail image is drawn from a file in your dataset, this will allow you to upload a separate image file to use as your dataset thumbnail. This uploaded image file will only be used as the dataset thumbnail; it will not be stored as a data file in your dataset.
pl: **Prześlij nowy plik:** Umożliwia przesłanie pliku graficznego z komputera i ustawienie go jako miniaturki zbioru danych. Domyślnie miniaturka jest pobierana z pliku w zbiorze danych, a to działanie pozwoli na przesłanie odrębnego pliku graficznego, który będzie używany jako miniaturka zbioru danych. Ten przesłany plik graficzny będzie używany tylko jako miniaturka zbioru danych; nie będzie przechowywany w zbiorze jako plik danych.

source: **Remove Thumbnail:** If you click the "Remove" button under the thumbnail image, you will remove the dataset's current thumbnail. The Dataset will then revert to displaying a basic default icon as the dataset thumbnail.
pl: **Usuń miniaturkę:** Po kliknięciu przycisku "Usuń" pod miniaturką, aktualna miniaturka zbioru danych zostanie usunięta, a przywrócona zostanie jego miniaturka domyślna.

source: When you're finished on this page, be sure to click "Save Changes" to save what you've done.
pl: Po zakończeniu działań na tej stronie należy pamiętać o kliknięciu przycisku "Zapisz zmiany".

source: If you prefer, it is also possible to set an image file in your dataset as your thumbnail by selecting the file, going to Edit Files -> Metadata, and using the "Set Thumbnail" button.
pl: Uwaga: możliwe jest również ustawienie miniaturki dla zbioru danych poprzez wybranie pliku i kliknięcie Edytuj pliki -> Metadane -> Edytuj -> "Ustaw jako miniaturkę".

source: Widgets
pl: Widżety

source: The Widgets feature provides you with code for your personal website so your dataset can be displayed. There are two types of Widgets for a dataset: the Dataset Widget and the Dataset Citation Widget. Widgets are found by going to your dataset page, clicking the "Edit" button (the one with the pencil icon) and selecting "Thumbnails + Widgets" from the dropdown menu.
pl: Funkcja widżetów generuje dla osobistej strony internetowej kod umożliwiający wyświetlenie w jej obrębie zbioru danych. Istnieją dwa rodzaje widżetów dla zbioru danych: widżet zbioru danych i widżety cytowania zbioru danych. Widżety można znaleźć na stronie zbioru danych, gdzie należy kliknąć przycisk "Edytuj"" i wybrać opcję "Miniatury + Widżety" z menu rozwijanego.

source: In the Widgets tab, you can copy and paste the code snippets for the widget you would like to add to your website. If you need to adjust the height of the widget on your website, you may do so by editing the `heightPx=500` parameter in the code snippet.
pl: W zakładce "Widżety" należy skopiować fragment kodu widżetu, który można następnie dodać do swojej strony internetowej. Wysokość widżetu można zmieniać edytując w kodzie parametr heightPx=500.

source: Dataset Widget
pl: Widżet zbioru danych

source: The Dataset Widget allows the citation, metadata, files and terms of your dataset to be displayed on your website. When someone downloads a data file in the widget, it will download directly from the datasets on your website. If a file is restricted, they will be directed to your dataverse to log in, instead of logging in through the widget on your site.
pl: Widżet zbioru danych umożliwia wyświetlanie na osobistej stronie internetowej poprawnego opisu bibliograficznego, metadanych i plików zbioru danych. Gdy ktoś rozpocznie pobieranie pliku danych w widżecie, plik pobrany zostanie bezpośrednio z poziomu osobistej strony internetowej. Jeśli dostęp do pobieranego pliku jest ograniczony, osoba pobierająca zostanie przekierowana do repozytorium, aby uprzednio się tam zalogować.

source: To edit your dataset, you will need to return to the Dataverse repository where the dataset is stored. You can easily do this by clicking on the link that says "Data Stored in (Name) Dataverse" found in the bottom of the widget.
pl: Edycja zbioru danych możliwa jest tylko w repozytorium, tj. w miejscu, w którym zbiór danych jest przechowywany. By przejść do edycji zbioru należy kliknąć link "Dane przechowywane w [nazwa repozytorium]" znajdujący się w dolnej części widżetu.

source: Dataset Citation Widget
pl: Widżet cytowania zbioru danych

source: The Dataset Citation Widget will provide a citation for your dataset on your personal or project website. Users can download the citation in various formats by using the Cite Data button. The persistent URL in the citation will direct users to the dataset in your dataverse.
pl: Ten widżet umożliwia cytowanie zbioru danych na osobistej stronie internetowej lub stronie projektu. Użytkownicy mogą pobrać umożliwiający zacytowanie zbioru opis bibliograficzny w różnych formatach, klikając na przycisk "Cytuj dane". Trwały adres URL w cytowaniu przekieruje użytkowników do zbioru danych w repozytorium.

source: Publish Dataset
pl: Publikowanie zbioru danych

source: When you publish a dataset (available to an Admin, Curator, or any custom role which has this level of permission assigned), you make it available to the public so that other users can browse or search for it. Once your dataset is ready to go public, go to your dataset page and click on the "Publish" button on the right hand side of the page. A pop-up will appear to confirm that you are ready to actually Publish since once a dataset is made public it can no longer be unpublished.
pl: Publikowanie zbioru danych oznacza jego publiczne udostępnienie. Funkcja ta dostępna jest tylko dla administratora, kuratora lub innego użytkownika, któremu przypisano odpowiednie uprawnienia. Opublikowany zbiór danych staje się dostępny dla wszystkich zainteresowanych osób przeglądających lub przeszukujących zasoby sieciowe. Aby opublikować zbiór danych należy przejść na jego stronę i kliknij przycisk "Opublikuj" widoczny po prawej. Pojawi się wyskakujące okienko, na którym należy potwierdzić zamiar opublikowania. Operacji opublikowania zbioru nie można cofnąć.

source: Whenever you edit your dataset, you are able to publish a new version of the dataset. The publish dataset button will reappear whenever you edit the metadata of the dataset or add a file.
pl: Opublikować nową wersję zbioru danych można za każdym razem, gdy zostanie dokonana jego edycja. Przycisk "Opublikuj" pojawi się ponownie po zapisaniu dowolnej edycji metadanych zbioru danych lub po dodaniu doń pliku.

source: Prior to publishing your dataset the Data Citation will indicate that this is a draft but the "DRAFT VERSION" text will be removed as soon as you Publish.
pl: Uwaga: Przed opublikowaniem zbioru danych, opis danych będzie wskazywał, że jest to jego wersja robocza. Informacja ta zostanie usunięta po opublikowaniu zbioru danych.

source: Submit for Review
pl: Prześlij do weryfikacji

source: If you have a Contributor or Depositor role in a Dataverse, you can submit your dataset for review when you have finished uploading your files and filling in all of the relevant metadata fields. To Submit for Review, go to your dataset and click on the "Submit for Review" button, which is located next to the "Edit" button on the upper-right. Once Submitted for Review: the Admin or Curator for this Dataverse will be notified to review this dataset before they decide to either "Publish" the dataset or "Return to Author". If the dataset is published the user making the deposit will be notified that it is now published. If the dataset is returned, the user making the deposit will be notified that they need to make modifications before it can be submitted for review again.
pl: Jeśli w danej kolekcji została Ci przypisana rola kontrybutora lub depozytora, po zakończeniu przesyłania plików danych i wypełnieniu odpowiednich pól metadanych, właściwym kolejnym krokiem jest przesłanie zbioru danych do weryfikacji przed ostatecznym opublikowaniem. Aby przesłać zbiór danych do weryfikacji należy przejść do zbioru danych i kliknąć przycisk "Przekaż do weryfikacji", który znajduje się obok przycisku "Edytuj" w prawym górnym rogu. Administrator lub kurator kolekcji zostanie powiadomiony o konieczności weryfikacji zbioru przed podjęciem ostatecznej decyzji o opublikowaniu zbioru danych lub jego zwróceniu do poprawy. Jeśli zbiór danych zostanie opublikowany, deponujący go użytkownik otrzyma powiadomienie o tym fakcie. Jeśli zbiór danych zostanie zwrócony do poprawy, osoba deponująca otrzyma powiadomienie o konieczności wprowadzenia zmian przed ponownym przesłaniem zbioru do weryfikacji.

source: Private URL to Review Unpublished Dataset
pl: Prywatny adres URL umożliwiający przejrzenie nie opublikowanego zbioru danych
