Repository: CeON/dataverse
Catalog: doc/sphinx-guides/source/locale/*/LC_MESSAGES/user/find-use-data.po
Languages: pl

source: Finding and Using Data
pl: Wyszukiwanie i korzystanie z danych

source: |toctitle|
pl: Zawartość:

source: Finding Data
pl: Wyszukiwanie Danych

source: Without logging in to Dataverse, users can browse Dataverse, search for dataverses, datasets, and files, view dataset descriptions and files for published datasets. To view an unpublished dataverse, dataset, or file, a user will need to be given permission from that dataverse's administrator to access it.
pl: Aby przeglądać kolekcje, szukać zbiorów danych, kolekcji, plików oraz przeglądać opisy opublikowanych zbiorów danych i plików, nie trzeba logować się do repozytorium. Aby wyświetlić nieopublikowaną kolekcję, zbiór danych lub plik, użytkownik musi otrzymać pozwolenie na dostęp do niego od osoby posiadającej do tego odpowiednie uprawnienia.

source: A user can search within a specific dataverse for the dataverses, datasets, and files it contains by using the search bar and facets displayed on that dataverse's page.
pl: Korzystając z paska wyszukiwania i filtrów wyświetlanych na stronie danej kolekcji, użytkownik może wyszukiwać jej kolekcje podrzędne, zbiory danych i pliki.

source: Basic Search
pl: Wyszukiwanie proste

source: You can search the entire contents of the Dataverse installation, including dataverses, datasets, and files. You can access the search through the search bar on the homepage, or by clicking "Search" in the header menu of every page. The search bar accepts search terms, queries, or exact phrases (in quotations).
pl: Można przeszukiwać całą zawartość repozytorium, w tym kolekcje, zbiory danych i pliki. Dostęp do tej funkcji można uzyskać za pomocą paska wyszukiwania na stronie głównej lub klikając "Szukaj" w menu w nagłówku dowolnej strony. Pasek wyszukiwania przyjmuje słowa kluczowe, zapytania lub dokładne frazy (które należy ująć w cudzysłów).

source: Sorting and Viewing Search Results
pl: Sortowanie i przeglądanie wyników wyszukiwania

source: Facets: to the left of the search results, there are several facets a user can click on to narrow the number of results displayed.
pl: Filtry: po lewej stronie wyników wyszukiwania znajduje się filtry, na które można kliknąć, aby zawęzić liczbę wyświetlanych wyników.

source: Choosing a facet: to choose a facet to narrow your results by, click on that facet.
pl: Wybór filtra: aby zawęzić wyniki wyszukiwania, należy kliknąć jeden z widocznych filtrów.

source: Removing a facet: A chosen facet can be removed by clicking on the X on it, either in the facets panel to the left, or above the results.
pl: Usuwanie filtra: aby usunąć wybrany filtr należy kliknąć znak "X" znajdujący się obok tego filtra w panelu filtrów po lewej stronie wyników wyszukiwania lub ponad nimi.

source: Viewing more or fewer facets: Each category in the facets panel lists the top 5 most common facets from that category. To view more, click on "More..." in the bottom right of that category. Once you've chosen to see more, an option to view less will appear in the bottom left of the facet.
pl: Zmiana liczby filtrów: każda kategoria w panelu filtrów zawiera listę 5 najczęściej występujących wartości. Aby zwiększyć liczbę wyświetlanych wartości, wybierz opcję "Więcej..." w prawym dolnym rogu kategorii. Jeśli chcesz zmniejszyć liczbę wyświetlanych wartości, skorzystaj z opcji "Mniej..." w lewym dolnym rogu tej kategorii.

source: Result cards: after entering a search term or query, result cards that match your term or query appear underneath the search bar and to the right of the facets.
pl: Karty wyników wyszukiwania: po wpisaniu zapytania lub wyszukiwanego słowa, karty tych wyników, które pasują do danego słowa lub zapytania, pojawiają się pod paskiem wyszukiwania po prawej stronie filtrów

source: Relevancy of results: each result card shows which metadata fields match the search query or term you entered into the search bar, with the matching term or query bolded. If the search term or query was found in the title or name of the dataverse, dataset, or file, the search term or query will be bolded within it.
pl: Trafność wyników: każda karta wyników pokazuje, które pola metadanych pasują do zapytania lub terminu wpisanego na pasku wyszukiwania, z pogrubionym pasującym zapytaniem lub słowem. Jeżeli wyszukiwane hasło lub zapytanie zostało znalezione w tytule lub nazwie kolekcji, zbioru danych lub pliku, wyszukiwane hasło lub zapytanie zostanie pogrubione w jego obrębie.

source: Other basic search features:
pl: Inne podstawowe funkcje wyszukiwania:

source: Sorting results: search results can be sorted by name (A-Z or Z-A), by date (newest or oldest), or by relevancy of results. The sort button can be found above the search results, in the top right.
pl: Sortowanie wyników: wyniki wyszukiwania mogą być sortowane według nazwy (A-Z lub Z-A), według daty (od najnowszych lub od najstarszych) albo według trafności. Przycisk sortowania znajduje się nad wynikami wyszukiwania, w prawym górnym rogu.

source: Bookmarkable URLs: search URLs can be copied and sent to a fellow researcher, or can be bookmarked for future sessions.
pl: Adresy URL a możliwość dodawania zakładek: adresy URL stron z wynikami danego wyszukiwania można skopiować, a następnie przesłać do innego badacza. lub dodać do zakładek przeglądarki internetowej do późniejszego wykorzystania.

source: Advanced Search
pl: Wyszukiwanie zaawansowane

source: To perform an advanced search, click the "Advanced Search" link next to the search bar. There you will have the ability to enter search terms for dataverses, dataset metadata (citation and domain-specific), and file-level metadata. If you are searching for tabular data files you can also search at the variable level for name and label. To find out more about what each field searches, hover over the field name for a detailed description of the field.
pl: Aby dokonać wyszukiwania zaawansowanego, należy kliknąć link "Wyszukiwanie zaawansowane" znajdujący się obok paska wyszukiwania. Wyszukiwanie zaawansowane daje możliwość wprowadzania wyszukiwanych terminów dla kolekcji, metadanych zbiorów danych (schematu cytowania oraz schematów dziedzinowych) oraz metadanych pliku. Jeśli szukasz tabelarycznych plików z danymi, możesz również wykonać wyszukiwania na poziomie nazwy i etykiety zmiennej. Aby poznać więcej szczegółów dotyczących znaczenia konkretnego pola należy najechać kursorem na nazwę pola, co pozwoli uzyskać jego szczegółowy opis.

source: Browsing Dataverse
pl: Przeglądanie zawartości repozytorium

source: In Dataverse, browsing is the default view when a user hasn't begun a search on the homepage or on a specific dataverse's page. When browsing, only dataverses and datasets appear in the results list and the results can be sorted by Name (A-Z or Z-A) and by Newest or Oldest.
pl: W repozytorium przeglądanie jest domyślnym widokiem jeśli użytkownik nie rozpoczął jeszcze wyszukiwania na stronie głównej lub na stronie określonej kolekcji. Podczas przeglądania, na liście wyników pojawiają się wyłącznie kolekcje i zbiory danych, a wyniki mogą być sortowane według nazwy (A-Z lub Z-A) oraz od najnowszych lub od najstarszych.

source: Saved Search
pl: Zapisywanie wyników wyszukiwania

source: Saved Search is currently an experimental feature only available to superusers. Please see the :doc:`/api/native-api` section of the API Guide for more information.
pl: Zapisywanie wyników wyszukiwania jest obecnie funkcją eksperymentalną, dostępną wyłącznie dla superużytkowników. Więcej informacji można znaleźć w sekcji :doc:`/api/native-api` w przewodniku API.

source: Using Data
pl: Korzystanie z danych

source: View Dataverses + Datasets
pl: Wyświetlanie kolekcji i zbiorów danych

source: After performing a search and finding the dataverse or dataset you are looking for, click on the name of the dataverse or dataset or on the thumbnail image to be taken to the page for that dataverse or dataset. Once on a dataverse page, you can view the dataverses, datasets, and files within that dataverse.
pl: Po zakończeniu wyszukiwania i odnalezieniu poszukiwanej kolekcji lub zbioru danych, należy kliknąć nazwę tej kolekcji lub zbioru danych albo obrazek miniaturki. Pozwoli to przenieść się na stronę tej kolekcji lub zbioru danych. Na stronie kolekcji widać znajdujące się w niej podkolekcje, zbiory danych i pliki.

source: Once on a dataset page, you will see the title, citation, description, and several other fields, as well as a button to email the dataset contact and a button to share the dataset on social media. Below that information, the files, metadata, terms of use, and version information for the dataset are available.
pl: Na stronie zbioru danych widoczne są: tytuł, cytowanie, opis i kilka innych pól metadanych, przycisk umożliwiający przesłanie wiadomości do osoby do kontaktu w sprawie tego zbioru danych oraz przycisk pozwalający udostępnić zbiór danych w serwisach społecznościowych. Poniżej tych informacji dostępne są informacje dotyczące plików, metadanych, ksiąg gości oraz wersji danego zbioru.

source: View Files
pl: Wyświetlanie plików

source: Files in Dataverse each have their own page that can be reached through the search results or through the Files table on their parent dataset's page. The dataset page and file page offer much the same functionality in terms of viewing and editing files, with a few small exceptions. The file page includes the file's persistent identifier (DOI or handle), which can be found under the Metadata tab. Also, the file page's Versions tab gives you a version history that is more focused on the individual file rather than the dataset as a whole.
pl: Pliki w repozytorium mają swoją własną stronę, do której można dotrzeć poprzez wyniki wyszukiwania lub poprzez tabelę plików na stronie zawierającego je zbioru danych. Strona zbioru danych i strona pliku oferują taką samą funkcjonalność w zakresie przeglądania i edycji plików, z kilkoma małymi wyjątkami. Strona pliku – w zależności od konfiguracji konkretnej instalacji repozytorium – może zawierać trwały identyfikator pliku (DOI lub handle), który można znaleźć w zakładce "Metadane". Ponadto, zakładka "Wersje" na stronie pliku zawiera historię wersji dotyczącą pojedynczego pliku, a nie całości zbioru danych.

source: Cite Data
pl: Cytowanie danych

source: You can find the citation for the dataset at the top of the dataset page in a blue box. Additionally, there is a Cite Data button that offers the option to download the citation as EndNote XML, RIS Format, or BibTeX Format.
pl: Sugerowane cytowanie zbioru danych znajduje się w polu na na górze strony zbioru danych. Dodatkowo dostępny jest przycisk "Cytuj zbiór danych", który umożliwia pobranie cytowania w formacie EndNote XML, RIS lub BibTeX.

source: Download Files
pl: Pobieranie plików

source: Within the Files tab on a dataset page, you can download the files in that dataset. To download more than one file at a time, select the files you would like to download and then click the Download button above the files. The selected files will download in zip format.
pl: W zakładce "Pliki" na stronie zbioru danych można pobrać pliki z danego zbioru danych. Aby pobrać więcej niż jeden plik naraz, należy zaznaczyć pliki, które mają zostać pobrane, a następnie kliknąć przycisk "Pobierz" znajdujący się nad plikami. Zaznaczone pliki zostaną spakowane razem w formacie zip i pobrane.

source: You may also download a file from its file page by clicking the Download button in the upper right corner of the page, or by :ref:`url_download` under the Metadata tab on the lower half of the page.
pl: Można również pobrać plik z poziomu strony tego pliku klikając przycisk "Pobierz" w prawym górnym rogu strony lub poprzez opcję :ref:`url_download` znajdującą się w zakładce "Metadane" w dolnej części tej strony.

source: Tabular data files offer additional options: You can explore using any data exploration or visualization :doc:`/installation/external-tools` (if they have been enabled) by clicking the Explore button, or choose from a number of tabular-data-specific download options available as a dropdown under the Download button.
pl: Dodatkowe możliwości wiążą się z plikami zawierającymi dane tabelaryczne. Można analizować je za pomocą zewnętrznych narzędzi do eksploracji i wizualizacji danych (jeśli zostały one włączone w danej instalacji - patrz sekcja :doc:`/installation/external-tools` w Installation Guide). W tym celu należy kliknąć przycisk "Eksploruj" lub wybrać jedną z wielu opcji pobierania danych tabelarycznych, jakie są dostępne w menu rozwijanym pod przyciskiem "Pobierz".

source: Tabular Data
pl: Dane tabelaryczne

source: Ingested files can be downloaded in several different ways.
pl: Przeanalizowane pliki można pobrać na kilka różnych sposobów.

source: The default option is to download a tab-separated-value file which is an easy and free standard to use,
pl: Domyślną opcją jest pobranie pliku zawierającego wartości oddzielone tabulatorem (TSV), który jest łatwym w użyciu wolnym standardem.

source: The original file, which may be in a proprietary format which requires special software,
pl: Oryginalny plik, który może być w formacie własnościowym i wymagać specjalnego oprogramowania

source: Rdata format if the installation has configured this,
pl: Format Rdata, o ile został skonfigurowany w danej instalacji repozytorium.

source: The variable metadata for the file in DDI format,
pl: Metadane zmiennych zawarte w pliku w formacie DDI.

source: A subset of the columns of the data.
pl: Podzbiór kolumn danych.

source: Downloading via URL
pl: Pobieranie za pomocą adresu URL

source: Dataverse displays a plaintext URL for the location of the file under the Metadata tab on the dataset page. This Download URL can be used to directly access the file via API (or in a web browser, if needed). When downloading larger files, in order to ensure a reliable, resumable download, we recommend using `GNU Wget <https://www.gnu.org/software/wget/>`_ in a command line terminal or using a download manager software of your choice.
pl: Repozytorium wyświetla tekstowy adres URL lokalizacji pliku w zakładce "Metadane" na stronie zbioru danych. Przy użyciu adresu URL można uzyskać bezpośredni dostęp do pliku za pośrednictwem API (lub przeglądarki internetowej, jeśli zachodzi taka potrzeba). Przy pobieraniu większych plików, w celu zapewnienia niezawodnego pobierania oraz umożliwienia jego wznawiania, zalecamy użycie programu `GNU Wget <https://www.gnu.org/software/wget/>`_ uruchamianego z pomocą wiersza poleceń albo innego menedżera pobierania.
